[{"term":"bitbloq-faq-title-1","definition":"Was ist Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-1","definition":"Bitbloq ist ein Online-Tool, mit dem auf einfache Art und Weise und ohne unbedingt Programmierkenntnisse zu besitzen, Programme für einen Mikrocontroller erstellt und in diesem geladen werden können.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-2","definition":"Wie funktioniert Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-2","definition":"Mit Bitbloq kannst du mit Blöcken auf schnelle und intuitive Art und Weise programmieren. Außerdem kannst du deine eigenen Projekte erstellen und sie mit der Gemeinschaft teilen. Elektronik und Programmieren haben noch nie so viel Spaß gemacht!","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-3","definition":"Was kann ich in Bitbloq erstellen?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-3","definition":"Mit Bitbloq und der Elektronik von BQ sind deiner Phantasie keine Grenzen gesetzt und du kannst alles von Robotern über Haushaltstechnik bis hin zu Elektronik-Spielzeug programmieren. Deiner Phantasie sind keine Grenzen gesetzt!","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-4","definition":"Wer steckt hinter diesem Projekt?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-4","definition":"Dieses Projekt wurde von BQ entworfen und entwickelt. Hier kannst du das große Team sehen, das dieses Projekt möglich macht.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-5","definition":"An wen richtet sich Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-5","definition":"An die Eltern, die ihren Kindern die Robotik, Elektronik oder Programmierung näherbringen möchten. Ihnen gibt Bitbloq die nötigen Werkzeuge an die Hand, damit sie in diese faszinierende Welt eintauchen können. An die Lehrer, die den Kindern zeigen möchten, wie sie Technologie entwickeln können. An die Kinder, die lernen möchten, wie Technologie funktioniert und ohne Einschränkungen ihre eigene erstellen möchten.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-6","definition":"Welche Platinen werden unterstützt?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-6","definition":"Aktuell werden die Platinen Freaduino UNO, Arduino UNO und BQ ZUM unterstützt, aber in Kürze kommen noch mehr hinzu, viel mehr sogar!","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-7","definition":"Wo befinden sich die Projekte, die ich im alten Bitbloq erstellt habe?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-7","definition":"Die Projekte des alten Bitbloq sind mit diesem neuen Toll nicht kompatibel. Daher konnten wir sie leider nicht übernehmen. Du musst diese Projekte mit dem neuen Tool erneut erstellen. Wir bedauern diese Umstände.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-8","definition":"Bitbloq und Scratch","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-8","definition":"Bitbloq verwendet das gleiche Programmierungsparadigma wie Scratch, d.h. es  werden Blöcke verwendet, die so ineinanderpassen, als würde es sich um ein Puzzle für die Konstruktion von Programmen handeln. Dies ermöglicht, dass die Programmierung auch für Kinder zugänglich ist, denn sie müssen sich keine Gedanken über die Syntax machen (sie müssen nicht lernen, wie man Code in einer Programmiersprache wie Processing, C++ oder Java erstellt). Bitbloq verwendet dieses Paradigma, da sich gezeigt hat, wie gut Kinder darauf ansprechen und weil Scratch bereits in vielen Schulen und Bildungseinrichtungen verwendet wird. Wir sind der Meinung, dass es besser ist, bestehende Kräfte zu nutzen, als das Rad neu zu erfinden. Wir haben Bitbloq mithilfe von frei zugänglichen Softwarebibliotheken entwickelt, insbesondere mit bloqs, einer von BQ entwickelten Bibliothek für das Erstellen von Anwendungen, die auf Blöcken basieren.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-9","definition":"Können mit Bitbloq Videospiele erstellt werden?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-9","definition":"Auf dem Computer können keine Videospiele erstellt werden. Allerdings wohl Spiele, die die Elektronik des Bausatzes Mi Primer Kit de Robótica oder vergleichbare Elektroniken mit der Platine ZUM enthalten oder eine mit Arduino kompatible Platine verwenden. Bei Scratch sollen die Kinder über das Erstellen von Videospielen lernen wie man programmiert. Mit Bitbloq hingegen lernen  die Kinder das Programmieren über die Verwendung von Elektronik und das Umsetzen von Robotik- und Automatisierungs-Projekten sowie eigene Erfindungen.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-10","definition":"Datenschutzerklärung","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-10","definition":"Die zur Verfügung gestellten persönlichen Daten sind Teil eines Ordners, dessen Verantwortlicher die Mundo Reader, S.L. ist und der gemäß den spanischen Datenschutzbedingungen verwaltet wird. Ziel ist es, den Nutzern diesen Service nach den geltenden Allgemeinen Bestimmungen anbieten zu können. Weitere Informationen finden sich in unserer Datenschutzerklärung unter www.bq.com. Mit dem Erstellen eines Kontos akzeptiert der Nutzer, dass er die Datenschutzbestimmungen gelesen hat und diesen zustimmt. Fragen zum Datenschutz oder zum Umgang mit persönlichen Daten bitte an lopd@bq.com.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-11","definition":"Web2Board lässt sich in Windows nicht öffnen.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-11","definition":"Installiere Web2Board erneut als Administrator. Klicke hierfür mit der rechten Maustaste auf die ausführbare Datei und wähle \"Als Administrator ausführen\".","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-12","definition":"Ich kann mich nicht bei Bitbloq anmelden.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-12","definition":"Überprüfe, ob das Datum und die Uhrzeit in deinem Computer richtig sind. Ist dies nicht der Fall, korrigiere sie zunächst und versuche es dann erneut.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-13","definition":"Die einzelnen Blöcke generieren keinen Code.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-13","definition":"Die neue Programmierstruktur von Bitbloq 2 ist so gedacht, dass du die Blöcke mit einem der Blöcke der Projekte verbinden musst (\"Globale Variablen und Funktionen\", \"Initialanweisungen (Setup)\" oder \"Hauptschleife (Loop)\"). Jeder Block, der nicht verbunden ist, generiert auch keinen Code und man sieht daher auch keine Auswirkung auf die Platine oder den Roboter.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-14","definition":"Die einzelnen Blöcke sind aus meinem Programm verschwunden.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-14","definition":"Die neue Programmierstruktur von Bitbloq 2 ist so gedacht, dass du die Blöcke mit einem der Blöcke der Projekte verbinden musst (\"Globale Variablen und Funktionen\", \"Initialanweisungen (Setup)\" oder \"Hauptschleife (Loop)\"). Ein Block, der nicht verbunden wurde, wird nicht im Projekt gespeichert.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-15","definition":"Warum kann man sich erst ab 14 Jahren ein Konto erstellen?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-15","definition":"Laut Gesetz zum Schutz persönlicher Daten würden wir, damit sich ein Kind unter 14 Jahren ein Konto erstellen kann, die ausdrückliche Erlaubnis des Vaters\/Mutters\/Lehrers benötigen, und diese müsste umfangreich dokumentiert werden. Daher können wir ihnen nicht erlauben, sich ein Nutzerkonto zu erstellen, sondern sie müssen ein Konto verwenden, dass von einer Person über 14 Jahre erstellt worden ist und dieses gemeinsam mit dieser Person verwenden.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-16","definition":"Die Platine wird nicht erkannt.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-16","definition":"Es kann verschiedene Gründe haben, warum die Platine nicht erkannt wird. Hier listen wir dir einige davon auf. Gehe sie durch und sende uns eine Nachricht, wenn sie dennoch nicht erkannt werden sollte.\n1.- Wenn es sich um eine ZUM-Platine handelt, überprüfe, dass sich der Schalter in der \"ON\"-Stellung befindet\n2.- Trenne alle Komponenten und versuche erneut, das Programm zu laden\n3.- Löse das USB-Kabel von der Platine und verbinde sie erneut\n4.- Drücke die Reset-Taste der Platine während du auf \"laden\" klickst. Lass die Taste kurz bevor die Programmierung der Platine beginnt los.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-17","definition":"Die LCD der BQ ZUM schaltet sich nicht ein.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-17","definition":"Vergewissere dich, dass die on\/off-Taste der Platine verbunden ist. Ist dies nicht der Fall, funktionieren zwar die einfacheren Komponenten, aber diejenigen, die mehr Leistung benötigen, funktionieren nicht.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-18","definition":"Ich kann mich mit Chrome nicht über Google plus anmelden.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-18","definition":"Aktualisiere Chrome auf die neueste Version. Bei ausstehenden Aktualisierungen ist möglicherweise kein Zugriff möglich.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-19","definition":"Wie verbindet man die LCD mit der Platine?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-19","definition":"Du musst die Taktleitung SCL mit dem in Bitbloq angegebenen analogen Pin \"S\" verbinden (bei einer BQ ZUM wäre dies der blaue Pin A5), anschließend die Datenleitung SDA mit dem in Bitbloq angegebenen analogen Pin \"S\" (bei einer BQ ZUM wäre dies der blaue Pin A4).\nDer Pin VCC kann mit jedem analogen Pin \"V\" verbunden werden und der Pin GDN mit jedem analogen Pin \"G\".","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-20","definition":"Auf der LCD-Anzeige erscheinen seltsame Zeichen ","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-20","definition":"Es gibt zwei Möglichkeiten, warum die LCD seltsame Zeichen angibt anstelle derer, die wir programmiert haben:\n1.-Die LCD akzeptiert keine Sonderzeichen wie ä, ü, ö oder ß. Schreiben wir sie, erscheinen seltsame Zeichen.\n2.-Überprüfe, dass der Schalter auf der Rückseite der LCD auf \"IIC\" steht. Ist dies nicht der Fall, erscheinen seltsame Zeichen.","context":"","term_plural":"","reference":"","comment":""}]