[
    {
        "term": "bitbloq-faq-title-1",
        "definition": "Què és Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-1",
        "definition": "Bitbloq és una eina en línia que permet crear programes per a un microcontrolador i carregar-los dins d'aquest de forma senzilla i sense necessitat de tenir coneixements de programació.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-2",
        "definition": "Com funciona Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-2",
        "definition": "Amb Bitbloq programaràs per blocs de forma ràpida i intuïtiva A més podràs crear els teus propis projectes i compartir-los amb la comunitat de Bitbloq. L'electrònica i la programació no havien estat mai tan divertides!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-3",
        "definition": "Què puc fer a Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-3",
        "definition": "Amb Bitbloq i l'electrònica de BQ podràs crear tot el que t'imaginis, des de robots fins a projectes de domòtica per a casa teva, passant per jocs electrònics. La teva imaginació no tindrà límits!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-4",
        "definition": "Qui hi ha darrere d'aquest projecte?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-4",
        "definition": "Aquest projecte es dissenya i es desenvolupa des de BQ. Aquí pots veure el gran equip que fa possible que aquest projecte estigui disponible.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-5",
        "definition": "A qui va adreçat?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-5",
        "definition": "Als pares i mares que volen iniciar als seus fills en la robòtica, l'electrònica o la programació. Bitbloq els donarà les eines necessàries perquè puguin endinsar-se en aquest món apassionant. Als professors que vulguin ensenyar als seus alumnes a crear tecnologia. Als infants que vulguin aprendre com funciona la tecnologia i vulguin crear projectes propis sense limitacions.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-6",
        "definition": "Quines plaques són compatibles?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-6",
        "definition": "Actualment les plaques compatibles són Freaduino UNO, Arduino UNO i BQ Zum, però pròximament n'afegirem més; moltes més!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-7",
        "definition": "On són els projectes que tenia a l'antic Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-7",
        "definition": "Els projectes de l'antic Bitbloq no són compatibles amb la nova eina, per la qual cosa no hem pogut fer el traspàs. Hauràs de crear de nou aquests projectes amb la nova eina. Sentim les molèsties.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-8",
        "definition": "Bitbloq i Scratch",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-8",
        "definition": "Bitbloq utilitza el mateix paradigma de programació que Scratch, és a dir, fan servir blocs que encaixen els uns amb els altres com si fos un puzle per construir programes. Això permet que la programació sigui accessible als infants, perquè no han de preocupar-se per la sintaxi (no cal que aprenguin a escriure el codi en un llenguatge de programació literal com ara Processing, C++ o Java). Bitbloq utilitza aquest paradigma perquè la seva eficàcia està demostrada amb els infants i perquè, a més, Scratch ja s'utilitza a moltes escoles i centres educatius. La nostra filosofia és que és molt millor treballar conjuntament que no pas tornar a inventar la roda. Hem desenvolupat Bitbloq utilitzant biblioteques de software amb llicència lliure, fonamentalment bloqs, una biblioteca desenvolupada per BQ per a la creació d'aplicacions en línia basades en blocs.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-9",
        "definition": "Es poden fer videojocs amb Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-9",
        "definition": "No es poden fer videojocs d'ordinador, però sí jocs utilitzant l'electrònica de El Meu Primer Kit de Robòtica o qualsevol altra electrònica que utilitzi la placa ZUM o una placa compatible amb Arduino. Scratch ha estat dissenyat per ensenyar als infants a programar realitzant videojocs, mentre que Bitbloq ha estat dissenyat per ensenyar als infants a programar utilitzant electrònica i a fer projectes robòtics, de domòtica, invents casolans, etc.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-10",
        "definition": "Política de privadesa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-10",
        "definition": "Les dades de caràcter personal proporcionades formaran part d'un fitxer del qual n'és responsable Mundo Reader, S.L., i que es gestionarà d'acord amb la normativa espanyola de protecció de dades amb la finalitat de poder oferir aquest servei als usuaris d'acord amb les condicions generals vigents. Consulteu la nostra política de privadesa a www.bq.com En crear un compte, l'usuari confirma que ha llegit i accepta les condicions de la política de privadesa. Si teniu qualsevol dubte respecte a la política o el tractament que fem de les vostres dades personals, contacteu amb lopd@bq.com",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-11",
        "definition": "Web2Board no s'obre a Windows",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-11",
        "definition": "Torna a instal·lar Web2Board com a administrador. Per fer-ho, fes clic amb el botó dret sobre l'executable i selecciona \"Executa’l com a administrador\".",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-12",
        "definition": "No puc iniciar la sessió a Bitbloq",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-12",
        "definition": "Comprova si la data i l'hora del teu ordinador són correctes. Si no és així, corregeix-les i torna-ho a provar.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-13",
        "definition": "Els blocs que estan solts no generen codi",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-13",
        "definition": "La nova estructura de programació de Bitbloq 2 està pensada de tal forma que has de connectar els blocs a algun bloc de projecte (\"Variables globals i funcions\", \"Instruccions inicials (Setup)\" o Bucle principal (Loop)\") Els bucles que no estiguin connectats no generaran codi i per tant no tindran efecte a la placa o robot.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-14",
        "definition": "Els blocs que estan solts han desaparegut del meu projecte",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-14",
        "definition": "La nova estructura de programació de Bitbloq 2 està pensada de tal manera que has de connectar els blocs a algun bloc de projecte (\"Variables globals i funcions\", \"Instruccions inicials (Setup)\" o Bucle principal (Loop)\") Els blocs que no estiguin connectats no es desaran al projecte.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-15",
        "definition": "Per què no poden crear-se un compte els menors de 14 anys?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-15",
        "definition": "Degut a la Llei Orgànica de Protecció de Dades de Caràcter Personal, per tal que un menor de 14 anys pugui crear-se un compte, necessitem tenir el permís explícit del pare\/mare\/tutor, els quals ens han de proporcionar extensa documentació. Per aquest motiu no els podem permetre la creació de comptes d'usuari. Hauran d'utilitzar comptes d'usuari creades per un usuari major de 14 anys i utilitzar Bitbloq acompanyats d'aquesta persona.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-16",
        "definition": "No em detecta la placa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-16",
        "definition": "Poden existir diversos problemes que fan que no es detecti la placa. A continuació te’n posem uns exemples. Prova'ls, i si tot i així segueix sense detectar-se, envia'ns un missatge.\n1.- Si la placa és “zum”, comprova que l'interruptor estigui en \"ON\"\n2.- Desconnecta tots els components connectats i intenta tornar a pujar el programa.\n3.- Desconnecta l'USB de la placa i torna'l a connectar.\n4.- Prem el botó “reset” de la placa mentre prems \"carrega\" Deixa'l anar just abans que comenci a programar la placa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-17",
        "definition": "A la bq ZUM, no se m'engega l'LCD.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-17",
        "definition": "Assegura't que el botó “on\/off” de la placa està connectat, perquè si no ho està, els components senzills sí que funcionen, però els que necessiten més potència, no funcionaran.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-18",
        "definition": "No puc accedir a Google Plus amb Chrome.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-18",
        "definition": "Actualitza Chrome a la darrera versió. Si té actualitzacions pendents, és possible que no hi puguis accedir.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-19",
        "definition": "Com es connecta l'LCD a la placa?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-19",
        "definition": "Has de connectar el cable de SCL al pin \"S\" analògic que s’indica a Bitbloq (a una bq ZUM, s’hauria de connectar al pin blau A5), després el cable SDA al pin \"S\" analògic  (a una bq ZUM seria el pin blau A4). El pin VCC es connecta a qualsevol pin analògic \"V\" i el pin GND es connecta a qualsevol pin analògic \"G\".",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-20",
        "definition": "La placa LCD mostra caràcters estranys.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-20",
        "definition": "Hi ha dues possible causes que poden fer que l'LCD mostri caràcters estranys en lloc dels que hem programat: \n1.- L'LCD no accepta l'escriptura d'alguns caràcters especials com ara \"¡\", \"¿\" o \"ñ\", o de caràcters accentuats. Si els fem servir, apareixeran caràcters estranys.\n2.- Comprova que l’interruptor de la part posterior de l'LCD està en la posició\"IIC\". Si no ho està, apareixen caràcters estranys.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    }
]