[
    {
        "term": "bitbloq-faq-title-1",
        "definition": "O que é o Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-1",
        "definition": "O Bitbloq é uma ferramenta online que permite criar programas para um microcontrolador e carregá-os no mesmo, de forma simples e sem ter necessariamente conhecimentos de programação.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-2",
        "definition": "Como funciona o Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-2",
        "definition": "Com o Bitbloq, programarás por blocos de forma rápida e intuitiva. Além disso, poderás criar os teus próprios projetos e partilhá-los com a comunidade. A eletrónica e a programação nunca foram tão divertidas!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-3",
        "definition": "O que posso fazer no Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-3",
        "definition": "Com o Bitbloq e a eletrónica da BQ, poderás criar tudo aquilo que imaginares, desde robots até projetos de domótica para casa, passando por jogos eletrónicos. A tua imaginação não terá limites!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-4",
        "definition": "Quem está por trás do projeto?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-4",
        "definition": "Este projeto foi concebido desenvolvido pela BQ. Podes aqui ver a grande equipa que faz com que este projeto esteja disponível.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-5",
        "definition": "A quem se destina?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-5",
        "definition": "O Bitbloq dá aos pais que queiram iniciar os seus filhos, na robótica, eletrónica ou programação, as ferramentas necessárias para entrarem neste mundo apaixonante. Aos professores que queiram ensinar às crianças a serem criadores de tecnologia. Às crianças que queiram aprender como funciona la tecnologia e queiram criar a sua própria sem qualquer limite.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-6",
        "definition": "Que placas são suportadas?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-6",
        "definition": "Atualmente suportamos as placas Freaduino UNO, Arduino UNO e BQ Zum, mas iremos em breve adicionar mais, muitas mais!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-7",
        "definition": "Onde estão os projetos que tinha o antigo Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-7",
        "definition": "Os projetos do antigo Bitbloq não são compatíveis com a nova ferramenta, por isso não foi possível fazer a transferência. Terás de voltar a criar esses projetos na nova ferramenta. Pedimos desculpa pelo inconveniente.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-8",
        "definition": "Bitbloq e Scratch",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-8",
        "definition": "O Bitbloq utiliza o mesmo paradigma de programação que Scratch, ou seja, utiliza blocos que encaixam uns nos outros como se fosse um puzzle para construir programas. Isto permite que a programação seja acessível para as crianças, porque não têm de se preocupar com a sintaxe (não precisam de aprender a escrever código numa linguagem de programação literal como Processing, C++ ou Java). O Bitbloq utiliza este paradigma porque a sua eficiência está demostrada junto das crianças e porque, além disso, o Scratch já é utilizado em muitas escolas e centros educativos. A nossa filosofia é que é melhor juntar forças do que reinventar a roda. Desenvolvemos o Bitbloq utilizando bibliotecas de software com licença livre, fundamentalmente a bloqs, uma biblioteca desenvolvida pela BQ para a criação de aplicações online baseadas em blocos.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-9",
        "definition": "É possível fazer videojogos com o Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-9",
        "definition": "Não é possível fazer videojogos no computador, mas sim jogos utilizando a eletrónica do Mi Primer Kit de Robótica ou qualquer outra eletrónica que utilize a placa ZUM ou uma placa compatível com Arduino. O Scratch foi concebido para ensinar às crianças a programar realizando videojogos, enquanto o Bitbloq foi concebido para ensinar às crianças a programar utilizando eletrónica e realizando projetos robóticos, domótica, invenções caseiras, etc.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-10",
        "definition": "Política de privacidade",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-10",
        "definition": "Os dados de caráter pessoal proporcionados farão parte de um ficheiro cujo responsável é a Mundo Reader, S.L., sendo este gerido em conformidade com a regulamentação espanhola de proteção de dados, com a finalidade de prestar este serviço aos utilizadores de acordo com as condições gerais em vigor. Consulta a nossa política de privacidade em www.bq.com. Ao criar uma conta, o utilizador reconhece ter lido e aceite as condições da política de privacidade. Se tiveres qualquer dúvida em relação à política ou ao tratamento que fazemos dos seus dados pessoais, contacta com lopd@bq.com.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-11",
        "definition": "O Web2Board não pode ser aberto no Windows",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-11",
        "definition": "Reinstala o Web2Board como administrador. Para isso, clica direito no executável e seleciona \"Executar como administrador\".",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-12",
        "definition": "No posso iniciar sessão no Bitbloq",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-12",
        "definition": "Verifica se a data e hora do teu computador estão corretas. Se não for o caso, corrige-as e tenta novamente.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-13",
        "definition": "Os blocos soltos não geram código",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-13",
        "definition": "A nova estrutura de programação do Bitbloq 2 está pensada de tal forma que é preciso conectar os blocos a algum bloco de projeto (\"Variáveis globais e funções\", \"Instruções iniciais (Setup)\" ou \"Circuito principal (Loop)\"). Qualquer bloco não conectado não gera código e portanto não se verás o seu efeito na placa ou robot.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-14",
        "definition": "Os blocos que estão soltos desapareceram do meu projeto",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-14",
        "definition": "A nova estrutura de programação do Bitbloq 2 está pensada de tal forma que é preciso conectar os blocos a algum bloco de projeto (\"Variáveis globais e funções\", \"Instruções iniciais (Setup)\" ou \"Circuito principal (Loop)\"). Qualquer bloco não conectado não será guardado no projeto.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-15",
        "definition": "Porque é que as crianças de menos de 14 anos não se podem criar uma conta?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-15",
        "definition": "Devido à lei orgânica de proteção de dados de caráter pessoal, para que um menor de 14 anos pudesse criar uma conta, devíamos ter a autorização explícita do pai\/mãe\/tutor, e estes nos fornecerem uma extensa documentação. Por essa razão, não podemos permitir que criem contas de utilizador mas apenas que utilizem contas de utilizadores criadas por pessoas de mais de 14 anos e utilizar o Bitbloq acompanhados dessa pessoa.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-16",
        "definition": "Não deteta a minha placa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-16",
        "definition": "Podem existir diferentes problemas que expliquem a não deteção da placa. Apresentamos alguns a seguir. Experimenta e se o problema persistir, envia-nos uma mensagem\n1.- Se a placa for uma zum, verifica se o interruptor está em \"ON\"\n2.- Desconecta todos os componentes conectados e tenta carregar novamente o programa\n3.- Desconecta o usb da placa e volte a conectá-la\n4.- Carrega no botão de reset da placa e clica ao mesmo tempo em \"carregar\". Solta-o imediatamente antes de começares a programar a placa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-17",
        "definition": "Na bq ZUM, o LCD não acende",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-17",
        "definition": "Verifica que o botão on\/off da placa está conectado, no caso contrário, os componentes simples funcionam, mas os componentes que precisam de mais potência não.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-18",
        "definition": "Não consigo aceder através de Google plus com Chrome",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-18",
        "definition": "Atualiza o Chrome para a última versão, uma vez que tem atualizações pendentes, é possível que não te deixe aceder.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-19",
        "definition": "Como conectar o LCD à placa?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-19",
        "definition": "Conecta o cabo de SCL ao pino \"S\" analógico indicado no Bitbloq (numa bq ZUM, seria conectá-lo ao pino azul A5), a seguir, o cabo SDA no pino \"S\" analógico indicado no Bitbloq (numa bq ZUM, seria no pino azul A4).\\No pino VCC é possível conectar qualquer pino analógico \"V\" e o pino GND pode ser conectado a qualquer pino analógico \"G\".",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-20",
        "definition": "Aparecem caráteres estranhos na placa LCD",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-20",
        "definition": "Existem duas causas possíveis pela quais podem aparecer caráteres estranhos no LCD em vez dos que foram programados:\n1.- O LCD não aceita a escrita de certos caráteres especiais tais como “¡”, “¿” ou “ñ” ou caráteres acentuados. Se forem usados, aparecem caráteres estranhos.\n2.- Verifica que o interruptor da parte traseira do LCD está em \"IIC\". Se não for o caso, aparecem caráteres estranhos.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    }
]