[{"title":{"ca-ES":"Què és Bitbloq?","de-DE":"Was ist Bitbloq?","en-GB":"What is Bitbloq?","es-ES":"¿Qué es Bitbloq?","eu-ES":"Zer da bitbloq?","fr-FR":"Bitbloq, quésaco ?","gl":"¿Qué é Bitbloq?","it-IT":"Che cos'è Bitbloq?","nl-NL":"Wat is Bitbloq?","pt-PT":"O que é o Bitbloq?","ru-RU":"Что такое Bitbloq?","zh-CN":"Bitbloq是什么?"},"content":{"ca-ES":"Bitbloq és una eina en línia que permet crear programes per a un microcontrolador i carregar-los dins d'aquest de forma senzilla i sense necessitat de tenir coneixements de programació.","de-DE":"Bitbloq ist ein Online-Tool, mit dem auf einfache Art und Weise und ohne unbedingt Programmierkenntnisse zu besitzen, Programme für einen Mikrocontroller erstellt und in diesem geladen werden können.","en-GB":"Bitbloq is an online tool that allows you to create programs for a microcontroller and load them onto it easily.","es-ES":"Bitbloq es una herramienta online que permite crear programas para un microcontrolador y cargarlos en el mismo de forma sencilla y sin tener necesariamente conocimientos de programación.","eu-ES":"bitbloq mikrokontrolagailu batentzako programak modu errazean eta programatzen jakin gabe sortu eta hartan kargatzea ahalbidetzen duen interneteko tresna da. ","fr-FR":"Bitbloq est un outil en ligne qui te permet de créer des programmes et de les charger facilement sur une carte contrôleur. Le tout sans connaissances préalables.","gl":"Bitbloq é unha ferramenta online que permite crear programas para un microcontrolador e cargalos no mesmo de forma sinxela e sen ter necesariamente coñecementos de programación.","it-IT":"Bitbloq è uno strumento che consente di creare programmi per microcontroller e caricarli in esso in modo semplice, senza che sia necessario avere conoscenze di programmazione.","nl-NL":"Bitbloq is een online waarmee je programma's kunt maken voor een microcontroller en eenvoudig naar kunt uploaden.","pt-PT":"O Bitbloq é uma ferramenta online que permite criar programas para um microcontrolador e carregá-os no mesmo, de forma simples e sem ter necessariamente conhecimentos de programação.","ru-RU":"Bitbloq – это онлайновый инструмент, позволяющий создавать программы для микроконтроллера и загружать их в него легко и просто, для этого не обязательно обладать знаниями в области программирования.","zh-CN":"Bitbloq是一个在线工具，可以让你轻松创建和上传到微控制器的程序，而不必任何编程知识。"},"order":1},{"title":{"ca-ES":"Com funciona Bitbloq?","de-DE":"Wie funktioniert Bitbloq?","en-GB":"How does Bitbloq work?","es-ES":"¿Cómo funciona Bitbloq?","eu-ES":"Nola funtzionatzen du bitbloq-ek?","fr-FR":"Comment ça marche ?","gl":"¿Cómo funciona bitbloq?","it-IT":"Come funziona Bitbloq?","nl-NL":"Hoe werkt Bitbloq?","pt-PT":"Como funciona o Bitbloq?","ru-RU":"Как работает Bitbloq?","zh-CN":"Bitbloq这么使用"},"content":{"ca-ES":"Amb Bitbloq programaràs per blocs de forma ràpida i intuïtiva A més podràs crear els teus propis projectes i compartir-los amb la comunitat de Bitbloq. L'electrònica i la programació no havien estat mai tan divertides!","de-DE":"Mit Bitbloq kannst du mit Blöcken auf schnelle und intuitive Art und Weise programmieren. Außerdem kannst du deine eigenen Projekte erstellen und sie mit der Gemeinschaft teilen. Elektronik und Programmieren haben noch nie so viel Spaß gemacht!","en-GB":"Bitbloq allows you to program using blocks in a quick and intuitive way. You can also create your own projects and share them with the community. Electronics and programming have never been so much fun!","es-ES":"Con Bitbloq programarás por bloques de forma rápida e intuitiva. Además, podrás crear tus propios proyectos y compartirlos con la comunidad. ¡La electrónica y la programación nunca han sido tan divertidas!","eu-ES":"bitbloq-i esker, blokeen bitartez programatu ahalko duzu, azkar eta modu intuitiboan. Gainera, zeure proiektuak sortu eta komunitatearekin konpartitu ahalko dituzu. Elektronika eta programazioa ez dira inoiz hain dibertigarriak izan!","fr-FR":"Avec Bitbloq, tu programmes par blocs. C’est rapide et intuitif.  Tu peux créer tes propres projets et les partager avec la communauté.  L’électronique et la programmation n’ont jamais été aussi amusantes !","gl":"Con bitbloq programarás por bloques de forma rápida e intuitiva. Ademais, vas poder crear os teus propios proxectos e compartilos coa comunidade. ¡A electrónica e a programación nunca foron tan divertidas!","it-IT":"Con Bitbloq potrai programmare per blocchi in modo rapido e intuitivo. Potrai creare i tuoi progetti e condividerli con la comunità. L'elettronica e la programmazione non sono mai state così divertenti!","nl-NL":"Bitbloq  je programmeren door op een snelle intuïtieve manier gebruik te maken van blokken. Je kunt dus je eigen projecten creëren en delen met de community. Elektronica en programmeren nog nooit zo leuk!","pt-PT":"Com o Bitbloq, programarás por blocos de forma rápida e intuitiva. Além disso, poderás criar os teus próprios projetos e partilhá-los com a comunidade. A eletrónica e a programação nunca foram tão divertidas!","ru-RU":"С помощью Bitbloq вы сможете быстро и интуитивно программировать посредством блоков. Кроме того, вы сможете создавать ваши собственные проекты и делиться ими с сообществом. Электроника и программирование никогда не были такими занимательными!","zh-CN":"跟Bitbloq块程序很快速，直观。此外，你可以创建自己的项目，并与社区分享。电子和编程从来没有这么好玩！"},"order":2},{"title":{"ca-ES":"Què puc fer a Bitbloq?","de-DE":"Was kann ich in Bitbloq erstellen?","en-GB":"What can I do with Bitbloq?","es-ES":"¿Qué puedo hacer en Bitbloq?","eu-ES":"Zer egin dezaket bitbloq-en?","fr-FR":"Qu'est-ce que je peux faire avec Bitbloq ?","gl":"¿Qué puedo hacer en Bitbloq?","it-IT":"Cosa posso fare in Bitbloq?","nl-NL":"Wat kan ik met Bitbloq?","pt-PT":"O que posso fazer no Bitbloq?","ru-RU":"Что я смогу делать на платформе Bitbloq?","zh-CN":"跟Bitbloq可以做什么?"},"content":{"ca-ES":"Amb Bitbloq i l'electrònica de BQ podràs crear tot el que t'imaginis, des de robots fins a projectes de domòtica per a casa teva, passant per jocs electrònics. La teva imaginació no tindrà límits!","de-DE":"Mit Bitbloq und der Elektronik von BQ sind deiner Phantasie keine Grenzen gesetzt und du kannst alles von Robotern über Haushaltstechnik bis hin zu Elektronik-Spielzeug programmieren. Deiner Phantasie sind keine Grenzen gesetzt!","en-GB":"Using Bitbloq and BQ electronics, you can create anything you can think of, from robots, home automation projects to electronic games. Your imagination truly has no limits!","es-ES":"Con Bitbloq y la electrónica de BQ podrás crear todo lo que te imagines, desde robots hasta proyectos de domótica para casa, pasando por juegos electrónicos. ¡Tu imaginación no tendrá límites!","eu-ES":"bitbloq-erekin eta BQ-ren elektronikarekin, burura etortzen zaizun guztia sortu ahalko duzu, etxerako domotika-proiektuak, joko elektronikoak, etab. Zure irudikapenak ez du mugarik izango!","fr-FR":"Avec Bitbloq et l’électronique BQ, tu peux créer tout ce que tu veux : des robots, des projets de domotique pour la maison, ou encore des jeux électroniques. Laisse parler ton imagination !","gl":"Con bitbloq e a electrónica de bq podrás crear todo o que che imaxines, desde robots até proxectos de domótica para casa, pasando por xogos electrónicos. ¡A tua imaxinación non terá límites!","it-IT":"Con Bitbloq e l'elettronica di BQ potrai creare tutto ciò che immagini, dai robot ai progetti di domotica per la casa, passando per i giochi elettronici. La tua immaginazione non avrà limiti!","nl-NL":"Met Bitbloq en BQelektronicakits je  wat je kunt bedenken. Robots, elektronische spelletjes en zelfs domoticaprojecten. Je verbeelding je !","pt-PT":"Com o Bitbloq e a eletrónica da BQ, poderás criar tudo aquilo que imaginares, desde robots até projetos de domótica para casa, passando por jogos eletrónicos. A tua imaginação não terá limites!","ru-RU":"С помощью Bitbloq и электроники от фирмы BQ вы сможете создавать все, что только подскажет вам ваше воображение, от роботов до электронных игр и бытовых проектов системы «умный дом». Вашему воображению не будет пределов!","zh-CN":"跟Bitbloq和BQ电子你可以创建所有你能想象，从机器人到家庭自动化工程或电子游戏。你的想象力是无限的！"},"order":3},{"title":{"ca-ES":"Qui hi ha darrere d'aquest projecte?","de-DE":"Wer steckt hinter diesem Projekt?","en-GB":"Who is behind this project?","es-ES":"¿Quién está detrás del proyecto?","eu-ES":"Nor dago proiektuaren atzean?","fr-FR":"Qui se cache derrière Bitbloq ?","gl":"¿Quén está detrás do proxecto?","it-IT":"Chi c'è dietro al progetto?","nl-NL":"?","pt-PT":"Quem está por trás do projeto?","ru-RU":"Кто является разработчиком проекта?","zh-CN":"谁是项目的负责人?"},"content":{"ca-ES":"Aquest projecte es dissenya i es desenvolupa des de BQ. Aquí pots veure el gran equip que fa possible que aquest projecte estigui disponible.","de-DE":"Dieses Projekt wurde von BQ entworfen und entwickelt. Hier kannst du das große Team sehen, das dieses Projekt möglich macht.","en-GB":"This project is being designed and developed at BQ. You can see the great team that makes Bitbloq a reality here.","es-ES":"Este proyecto se está diseñando y desarrollando desde BQ. Aquí puedes ver el gran equipo que hace posible que este proyecto esté disponible.","eu-ES":"BQ-n ari dira proiektua diseinatzen eta garatzen. Hemen ikus dezakezu proiektua erabilgarri egotea posible egiten duen langile-talde handia.","fr-FR":"Ce projet a été conçu et développé par BQ. Tu peux voir ici l'équipe grâce à qui ce projet a pris vie.","gl":"Este proxecto se está deseñando e desenvolvendo desde BQ. Aquí podes ver o gran equipo que fai posible que este proxecto esté dispoñible.","it-IT":"Il progetto è ideato e sviluppato da BQ. Qui puoi vedere il grande team che rende disponibile questo progetto.","nl-NL":"Dit project is ontworpen en ontwikkeld door BQ. Hier kun je het geweldige team zien Bitbloq .","pt-PT":"Este projeto foi concebido desenvolvido pela BQ. Podes aqui ver a grande equipa que faz com que este projeto esteja disponível.","ru-RU":"Данный проект разрабатывается в компании BQ. Здесь вы можете увидеть ту великолепную команду, которая делает этот проект доступным для пользователей.","zh-CN":"本项目是BQ设计和开发。你可以在这里看到伟大的团队。"},"order":4},{"title":{"ca-ES":"A qui va adreçat?","de-DE":"An wen richtet sich Bitbloq?","en-GB":"Who is Bitbloq for?","es-ES":"¿A quién va dirigido?","eu-ES":"Nori dago zuzendua?","fr-FR":"À qui s'adresse Bitbloq ?","gl":"¿A quen vai dirixido?","it-IT":"A chi è rivolto?","nl-NL":"Voor wie is Bitbloq?","pt-PT":"A quem se destina?","ru-RU":"Для кого он предназначен?","zh-CN":"给谁?"},"content":{"ca-ES":"Als pares i mares que volen iniciar als seus fills en la robòtica, l'electrònica o la programació. Bitbloq els donarà les eines necessàries perquè puguin endinsar-se en aquest món apassionant. Als professors que vulguin ensenyar als seus alumnes a crear tecnologia. Als infants que vulguin aprendre com funciona la tecnologia i vulguin crear projectes propis sense limitacions.","de-DE":"An die Eltern, die ihren Kindern die Robotik, Elektronik oder Programmierung näherbringen möchten. Ihnen gibt Bitbloq die nötigen Werkzeuge an die Hand, damit sie in diese faszinierende Welt eintauchen können. An die Lehrer, die den Kindern zeigen möchten, wie sie Technologie entwickeln können. An die Kinder, die lernen möchten, wie Technologie funktioniert und ohne Einschränkungen ihre eigene erstellen möchten.","en-GB":"For parents want to introduce their kids to robotics, electronics or programming; Bitbloq provides them with the necessary tools to enter this exciting world. For teachers that want to teach children how to create technology. For children that want to learn how technology works and how to create it for themselves, without limitations.","es-ES":"A los padres que quieren iniciar a sus hijos en la robótica, electrónica o programación, Bitbloq les dará las herramientas necesarias para que se adentren en este apasionante mundo. A los profesores que quieran enseñar a los niños a ser creadores de tecnología. A los niños que quieran aprender cómo funciona la tecnología y quieran crear la suya propia sin tener ningún límite.","eu-ES":"Euren seme-alabei robotika, elektronika eta programazioan  abiarazi nahi dieten gurasoei, bitbloq-ek beharrezko tresnak emango dizkiete mundu zirraragarri honetan barnera daitezen. Haurrei teknologia-sortzaile izateko irakatsi nahi dieten irakasleei. Teknologiak nola funtzionatzen duen eta eurena mugarik gabe sortu nahi duten haurrei.","fr-FR":"Aux parents qui souhaitent initier leurs enfants à la robotique, l’électronique ou encore à la programmation. Grâce à Bitbloq, ils disposeront des outils nécessaires pour découvrir ce monde passionnant. Aux enseignants qui souhaitent apprendre aux enfants à devenir des créateurs de technologie. Aux enfants qui veulent comprendre le fonctionnement de la technologie et créer librement leurs propres inventions.","gl":"Aos pais que queren iniciar aos seus fillos na robótica, electrónica ou programación, Bitbloq daralles as ferramentas necesarias para que se penetren neste apaixonante mundo. Aos profesores que queiran ensinar aos nenos a ser creadores de tecnoloxía. Aos nenos que queiran aprender como funciona a tecnoloxía e queiran crear a súa propia sen ter ningún límite.","it-IT":"Ai genitori che desiderano iniziare i propri figli alla robotica, all'elettronica o alla programmazione: Bitbloq fornirà loro gli strumenti necessari affinché possano esplorare questo mondo appassionante. Ai professori che desiderino insegnare ai ragazzi a diventare creatori di tecnologia. Ai ragazzi che desiderino imparare come funziona la tecnologia e crearne a loro volta senza limiti di sorta.","nl-NL":".","pt-PT":"O Bitbloq dá aos pais que queiram iniciar os seus filhos, na robótica, eletrónica ou programação, as ferramentas necessárias para entrarem neste mundo apaixonante. Aos professores que queiram ensinar às crianças a serem criadores de tecnologia. Às crianças que queiram aprender como funciona la tecnologia e queiram criar a sua própria sem qualquer limite.","ru-RU":"Для родителей, которые хотят познакомить своих детей с робототехникой, электроникой и программированием; Bitbloq предоставит необходимый инструментарий для погружения в этот увлекательный мир. Для преподавателей, желающих научить детей быть создателями технологий. Для детей, которые хотят понять, как работает техника, и стремятся создавать свои собственные технические устройства без каких-либо ограничений.","zh-CN":"如果家长想要他的孩子开始设计自己的机器人, 电子或编程, Bitbloq提供令人兴奋的必要工具。如果老师想要教小朋友如何变成技术的创造者。如果小孩想要学科技怎么运用也想要创建没有任何限制自己的科技。"},"order":5},{"title":{"ca-ES":"Quines plaques són compatibles?","de-DE":"Welche Platinen werden unterstützt?","en-GB":"Which boards are supported?","es-ES":"¿Qué placas soportamos?","eu-ES":"Zein plaka jasaten ditugu?","fr-FR":"Quelles cartes contrôleurs puis-je utiliser ?","gl":"¿Qué placas soportamos?","it-IT":"Quali schede sono supportate?","nl-NL":"Welke controllerboards worden ondersteund?","pt-PT":"Que placas são suportadas?","ru-RU":"Какие платы поддерживаются?","zh-CN":"我们支持哪些板？"},"content":{"ca-ES":"Actualment les plaques compatibles són Freaduino UNO, Arduino UNO i BQ Zum, però pròximament n'afegirem més; moltes més!","de-DE":"Aktuell werden die Platinen Freaduino UNO, Arduino UNO und BQ ZUM unterstützt, aber in Kürze kommen noch mehr hinzu, viel mehr sogar!","en-GB":"At the moment the supported boards are : Freaduino UNO, Arduino UNO and BQ Zum, but we will add more soon, many more!","es-ES":"Actualmente soportamos las placas Freaduino UNO, Arduino UNO y BQ Zum, pero próximamente añadiremos más, ¡muchas más!","eu-ES":"Egun, Freaduino UNO, Arduino UNO eta BQ Zum plakak jasaten ditugu, baina, aurki, gehiago, askoz ere gehiago gehituko ditugu!","fr-FR":"Pour le moment Bitbloq est compatible avec les cartes contrôleurs Freaduino UNO, Arduino UNO et BQ Zum, mais reste connecté, nous avons programmé l'ajout de nouvelles cartes !","gl":"Actualmente soportamos as placas Freaduino UN, Arduino UN e BQ Zum, pero próximamente engadiremos máis, ¡moitas máis!","it-IT":"Al momento sono supportate le schede Freaduino UNO, Arduino UNO e BQ Zum, ma presto ne aggiungeremo altre!","nl-NL":"Op dit moment zijn dat: Freaduino UNO, Arduino UNO en BQ Zum, zullen er snel meer toevoegen, veel meer!","pt-PT":"Atualmente suportamos as placas Freaduino UNO, Arduino UNO e BQ Zum, mas iremos em breve adicionar mais, muitas mais!","ru-RU":"В настоящее время это платы Freaduino UNO, Arduino UNO и BQ Zum, однако в ближайшее время мы расширим этот круг, и расширим значительно!","zh-CN":"我们目前支持的Frearduino UNO,Arduino UNO和BQ Zum板，但我们会增加更多！"},"order":6},{"title":{"ca-ES":"On són els projectes que tenia a l'antic Bitbloq?","de-DE":"Wo befinden sich die Projekte, die ich im alten Bitbloq erstellt habe?","en-GB":"Where are the projects I already had in the old Bitbloq?","es-ES":"¿Dónde están los proyectos que tenía en el antiguo Bitbloq?","eu-ES":"Non daude antzinako bitbloq-en nituen proiektuak?","fr-FR":"Que deviennent mes projets créés dans l'ancien Bitbloq ?","gl":"¿Onde están os proxectos que tiña no antigo Bitbloq?","it-IT":"Dove si trovano i progetti del vecchio Bitbloq?","nl-NL":"Waar zijn de projecten die ik al toegevoegd had in de oude Bitbloq?","pt-PT":"Onde estão os projetos que tinha o antigo Bitbloq?","ru-RU":"Где находятся проекты, которые у меня были на старом Bitbloq?","zh-CN":"究Bitbloq的项目在哪里？"},"content":{"ca-ES":"Els projectes de l'antic Bitbloq no són compatibles amb la nova eina, per la qual cosa no hem pogut fer el traspàs. Hauràs de crear de nou aquests projectes amb la nova eina. Sentim les molèsties.","de-DE":"Die Projekte des alten Bitbloq sind mit diesem neuen Toll nicht kompatibel. Daher konnten wir sie leider nicht übernehmen. Du musst diese Projekte mit dem neuen Tool erneut erstellen. Wir bedauern diese Umstände.","en-GB":"The projects that were developed using the old Bitbloq are not compatible with the new tool and we were not able to transfer them. You will have to create them from scratch in this new Bitbloq 2. We apologise for any inconvenience.","es-ES":"Los proyectos del antiguo Bitbloq no son compatibles con la nueva herramienta, por eso no hemos podido hacer el traspaso. Tendrás que crear de nuevo esos proyectos en la nueva herramienta. Sentimos las molestias.","eu-ES":"Antzinako bitbloq-eko proiektuak ez dira tresna berriarekin bateragarriak, horregatik ezin izan ditugu transferitu. Proiektu horiek berriro sortu beharko dituzu tresna berrian. Barkatu eragozpenak","fr-FR":"Les projets créés dans l'ancien Bitbloq ne sont pas compatibles avec la nouvelle version. C'est pourquoi nous n'avons malheureusement pas pu les transférer. Tu devras donc recréer tes projets dans le nouveau Bitbloq. Désolés de te décevoir...","gl":"Os proxectos do antigo Bitbloq non son compatibles coa nova ferramenta, por iso non puidemos facer o traspaso. Terás que crear de novo eses proxectos na nova ferramenta. Sentimos as molestias.","it-IT":"I progetti del vecchio Bitbloq non sono compatibili con il nuovo strumento, e non è stato possibile quindi realizzare il trasferimento. Dovrai creare di nuovo tali progetti nel nuovo strumento. Ci scusiamo per il disagio.","nl-NL":"rojecten die met de oude Bitloqniet compatib met  nieuwe en omzetten. Je zult ze opnieuw moeten maken in de nieuwe versie van Bitbloq 2. Onze excuses voor het ongemak.","pt-PT":"Os projetos do antigo Bitbloq não são compatíveis com a nova ferramenta, por isso não foi possível fazer a transferência. Terás de voltar a criar esses projetos na nova ferramenta. Pedimos desculpa pelo inconveniente.","ru-RU":"Проекты прежнего Bitbloq несовместимы с новым инструментом, поэтому нам не удалось перенести их. Вам необходимо будет заново создать эти проекты на новой платформе. Приносим извинения за доставленные неудобства.","zh-CN":"因为Bitbloq老项目不符合新的工具，所以我们就无法转移你的项目。你必须用新的工具重新创建新它们。很抱歉给你带来不便。"},"order":7},{"title":{"ca-ES":"Bitbloq i Scratch","de-DE":"Bitbloq und Scratch","en-GB":"Bitbloq and Scratch","es-ES":"Bitbloq y Scratch","eu-ES":"bitbloq eta Scratch","fr-FR":"Bitbloq et Scratch","gl":"Bitbloq e Scratch","it-IT":"Bitbloq e Scratch","nl-NL":"Bitbloq en Scratch","pt-PT":"Bitbloq e Scratch","ru-RU":"Bitbloq и Scratch","zh-CN":"Bitbloq和Scratch"},"content":{"ca-ES":"Bitbloq utilitza el mateix paradigma de programació que Scratch, és a dir, fan servir blocs que encaixen els uns amb els altres com si fos un puzle per construir programes. Això permet que la programació sigui accessible als infants, perquè no han de preocupar-se per la sintaxi (no cal que aprenguin a escriure el codi en un llenguatge de programació literal com ara Processing, C++ o Java). Bitbloq utilitza aquest paradigma perquè la seva eficàcia està demostrada amb els infants i perquè, a més, Scratch ja s'utilitza a moltes escoles i centres educatius. La nostra filosofia és que és molt millor treballar conjuntament que no pas tornar a inventar la roda. Hem desenvolupat Bitbloq utilitzant biblioteques de software amb llicència lliure, fonamentalment bloqs, una biblioteca desenvolupada per BQ per a la creació d'aplicacions en línia basades en blocs.","de-DE":"Bitbloq verwendet das gleiche Programmierungsparadigma wie Scratch, d.h. es  werden Blöcke verwendet, die so ineinanderpassen, als würde es sich um ein Puzzle für die Konstruktion von Programmen handeln. Dies ermöglicht, dass die Programmierung auch für Kinder zugänglich ist, denn sie müssen sich keine Gedanken über die Syntax machen (sie müssen nicht lernen, wie man Code in einer Programmiersprache wie Processing, C++ oder Java erstellt). Bitbloq verwendet dieses Paradigma, da sich gezeigt hat, wie gut Kinder darauf ansprechen und weil Scratch bereits in vielen Schulen und Bildungseinrichtungen verwendet wird. Wir sind der Meinung, dass es besser ist, bestehende Kräfte zu nutzen, als das Rad neu zu erfinden. Wir haben Bitbloq mithilfe von frei zugänglichen Softwarebibliotheken entwickelt, insbesondere mit bloqs, einer von BQ entwickelten Bibliothek für das Erstellen von Anwendungen, die auf Blöcken basieren.","en-GB":"Bitbloq uses the same programming paradigm as Scratch, meaning that it uses blocks to build programs which fit together like pieces of a puzzle. This makes programming accessible to kids, as they don´t have to worry about the syntax (i.e. they don´t need to learn how to write code in a literal programming language such as Processing, C++ or Java). Bitbloq uses this paradigm because it has been proven to be effective among children, and also because Scratch is already used in many schools and education centres. Our philosophy is that it´s better to join forces than to reinvent the wheel. We have developed Bitbloq using open source software libraries, primarily Bloqs, a library developed by BQ for creating online applications using blocks.","es-ES":"Bitbloq utiliza el mismo paradigma de programación que Scratch, es decir, emplea bloques que encajan unos con otros como si fuera un puzzle para construir programas. Esto permite que la programación sea accesible para los niños, porque no tienen que preocuparse por la sintaxis (no necesitan aprender cómo se escribe código en un lenguaje de programación literal como Processing, C++ o Java). bitbloq utiliza este paradigma porque está demostrada su eficacia entre los niños y porque, además, scratch ya se utiliza en multitud de escuelas y centros educativos. Nuestra filosofía es que es mejor aunar fuerzas que reinventar la rueda. Hemos desarrollado bitbloq utilizando bibliotecas de software con licencia libre, fundamentalmente bloqs, una biblioteca desarrollada por BQ para la creación de aplicaciones online basadas en bloques.","eu-ES":"bitbloq-ek Scratch-ek erabiltzen duen programazio-paradigma bera erabiltzen du, hau da, batzuk besteekin puzzleen moduan ahokatzen diren blokeak erabiltzen ditu programak sortzeko.  Honek programazioa haurrentzat erabilgarria izatea ahalbidetzen du, sintaxiaz ez direlako kezkatu behar (ez dute kodea Processing, C++ edo Java bezalako programazio literal batean idazten ikasi beharrik ). Haurrengan eraginkorra dela ikusi delako eta ikastetxe ugarik dagoeneko Scratch erabiltzen dutelako erabiltzen du bitbloq-ek paradigma hau. Gure filosofia gurpila berriz asmatu baino hobe dela indarrak bateratzea da. Lizentzia askeko software-liburutegien bitartez garatu dugu bitbloq, bereziki bloqs, blokeetan oinarritutako interneteko aplikazioak sortzeko BQ-k sortutako liburutegia.","fr-FR":"Bitbloq utilise le même paradigme de programmation que Scratch, c’est-à-dire que Bitbloq emploie des blocs s’emboîtant les uns dans les autres, comme les pièces d’un puzzle, pour construire des programmes. La programmation est ainsi accessible aux enfants car ils n’ont pas à se préoccuper de la syntaxe (c’est-à-dire qu’ils n’ont pas besoin d’apprendre à écrire le code dans un langage de programmation littéral tel que Processing, C++ ou Java). Bitbloq utilise ce paradigme car son efficacité chez les enfants a été démontrée. De plus, Scratch est déjà utilisé dans de nombreux établissements scolaires et centres éducatifs. Notre philosophie est qu’il vaut mieux unir nos forces que réinventer ce qui existe déjà. Nous avons développé Bitbloq en utilisant des bibliothèques de logiciels sous licence libre. Nous nous sommes appuyés principalement sur bloqs, une bibliothèque développée par BQ pour la création d’applications en ligne basées sur des blocs. ","gl":"Bitbloq utiliza o mesmo paradigma de*programación que Scratch, é dicir, emprega bloques que encaixan uns con outros coma se fose un puzzle para construír programas. Isto permite que a programación sexa accesible para os nenos, porque non teñen que preocuparse pola sintaxe (non necesitan aprender como se escribe código nunha linguaxe de programación literal como Processing, C ou Java). bitbloq utiliza este paradigma porque está demostrada a súa eficacia entre os nenos e porque, ademais, scratch xa se utiliza en multitude de escolas e centros educativos. A nosa filosofía é que é mellor axuntar forzas que reinventar a roda. desenvolvemos bitbloq utilizando bibliotecas de software con licenza libre, fundamentalmente bloqs, unha biblioteca desenvolvida por BQ para a creación de aplicacións online baseadas en bloques.","it-IT":"Bitbloq usa lo stesso paradigma di programmazione di Scratch, ovvero, impiega blocchi che si incastrano gli uni negli altri, come in un puzzle, per costruire programmi. Ciò rende la programmazione accessibile ai bambini, che non devono preoccuparsi della sintassi (non devono imparare a scrivere in un linguaggio di programmazione letterale come Processing, C++ o Java). Bitbloq utilizza questo paradigma perché è dimostrata la sua efficacia tra i bambini e perché, inoltre, Scratch è già utilizzato in molte scuole e in molti centri educativi. La nostra filosofia è: meglio unire le forze, che impegnarsi da soli per scoprire l'acqua calda! Abbiamo sviluppato Bitbloq utilizzando biblioteche software con licenza free, fondamentalmente Bloqs, una biblioteca sviluppata da BQ per la creazione di applicazioni online basate su blocchi.","nl-NL":"Bitbloq gebruikt zelfde programmeer als Scratch, wat betekent dat het gebruik maakt van blokken . Dit maakt het programmeren toegankelijk voor kinderen omdat ze zich geen zorgen hoeven te maken over de syntaxis (dat wil zeggen dat ze geen programmeertaal hoeven te leren zoals C++ of Java). Bitbloq gebruikt dit omdat het bewezen effectief  bij kinderen en ook omdat Scratch  in veel leeromgevingen gebruikt wordt. Onze filosofie is om krachten te bundelen in plaats van het wiel opnieuw uit te vinden. We hebben Bitloq van open source softwarebibliotheken.","pt-PT":"O Bitbloq utiliza o mesmo paradigma de programação que Scratch, ou seja, utiliza blocos que encaixam uns nos outros como se fosse um puzzle para construir programas. Isto permite que a programação seja acessível para as crianças, porque não têm de se preocupar com a sintaxe (não precisam de aprender a escrever código numa linguagem de programação literal como Processing, C++ ou Java). O Bitbloq utiliza este paradigma porque a sua eficiência está demostrada junto das crianças e porque, além disso, o Scratch já é utilizado em muitas escolas e centros educativos. A nossa filosofia é que é melhor juntar forças do que reinventar a roda. Desenvolvemos o Bitbloq utilizando bibliotecas de software com licença livre, fundamentalmente a bloqs, uma biblioteca desenvolvida pela BQ para a criação de aplicações online baseadas em blocos.","ru-RU":"Bitbloq использует ту же парадигму программирования, что и Scratch, то есть использует для написания программ блоки, сочетающиеся друг с другом, как кусочки паззла. Это позволяет сделать программирование доступным для детей, поскольку им не требуется думать о синтаксисе (не нужно учиться, как писать код на настоящем языке программирования, например, Processing, C++ или Java). Bitbloq использует эту парадигму, так как ее эффективность при работе с детьми проверена временем, а кроме того, scratch уже используется в большом количестве школ и образовательных учреждений. Наша философия заключается в том, что лучше объединять усилия, чем изобретать колесо. Мы разработали Bitbloq, используя библиотеки свободного ПО, в основном bloqs – библиотеку, разработанную компанией BQ для создания онлайн-приложений на основе блоков.","zh-CN":"Bitbloq使用像Scratch相同编程范式，像拼图一样即采用模块组合在一起。孩子们不许担心语法（无需学习C ++或Java编写代码）。Bitbloq 使用这种模式因为对孩子很有效, 而且scratch被使用在许多学校和教育中心。我们的理念是联手比较好。我们开发Bitbloq使用自由软件库, 比如bloqs, BQ开发的库。"},"order":8},{"title":{"ca-ES":"Es poden fer videojocs amb Bitbloq?","de-DE":"Können mit Bitbloq Videospiele erstellt werden?","en-GB":"Can video games be made using Bitbloq?","es-ES":"¿Pueden hacerse videojuegos con Bitbloq?","eu-ES":"Bitbloq-ekin bideo-jokoak ere egin al daitezke ?","fr-FR":"Peut-on réaliser des jeux vidéo avec Bitbloq ?","gl":"¿Poden facerse videoxogos con bitbloq?","it-IT":"Si possono realizzare videogiochi con Bitbloq?","nl-NL":"Kunnen met Bitbloq?","pt-PT":"É possível fazer videojogos com o Bitbloq?","ru-RU":"Можно ли создавать видеоигры с помощью Bitbloq?","zh-CN":"用Bitbloq可以设计游戏吗?"},"content":{"ca-ES":"No es poden fer videojocs d'ordinador, però sí jocs utilitzant l'electrònica de El Meu Primer Kit de Robòtica o qualsevol altra electrònica que utilitzi la placa ZUM o una placa compatible amb Arduino. Scratch ha estat dissenyat per ensenyar als infants a programar realitzant videojocs, mentre que Bitbloq ha estat dissenyat per ensenyar als infants a programar utilitzant electrònica i a fer projectes robòtics, de domòtica, invents casolans, etc.","de-DE":"Auf dem Computer können keine Videospiele erstellt werden. Allerdings wohl Spiele, die die Elektronik des Bausatzes Mi Primer Kit de Robótica oder vergleichbare Elektroniken mit der Platine ZUM enthalten oder eine mit Arduino kompatible Platine verwenden. Bei Scratch sollen die Kinder über das Erstellen von Videospielen lernen wie man programmiert. Mit Bitbloq hingegen lernen  die Kinder das Programmieren über die Verwendung von Elektronik und das Umsetzen von Robotik- und Automatisierungs-Projekten sowie eigene Erfindungen.","en-GB":"It´s not possible to make video games on the computer, but it can be done using electronics with My First Robotics Kit, or any other electronics that use Zum or another board compatible with Arduino. Scratch has been designed to teach to kids to program by making video games, whereas Bitbloq is designed to teach to them through electronics, by creating robotics projects, domotics and home inventions, etc.","es-ES":"No pueden hacerse videojuegos en el ordenador, pero sí juegos utilizando la electrónica de Mi Primer Kit de Robótica o cualquier otra electrónica que use la placa ZUM o una placa compatible con Arduino. Scratch ha sido diseñado para enseñar a los niños a programar realizando videojuegos, mientras que Bitbloq ha sido diseñado para enseñar a los niños a programar usando electrónica y realizando proyectos robóticos, domótica, inventos caseros, etc.","eu-ES":"Bideo-jokoak ezin dira ordenagailuan egin, baina bai jokoak Mi Primer Kit de Robótica (Robotikako nire lehenengo kita) edo ZUM plaka edo Arduinorekin bateragarria den beste plaka bat erabiltzen duten beste edozein elektronikarekin. Scratch haurrei bideo-jokoak eginez programatzen irakasteko diseinatu da; bitbloq, aldiz, haurrei elektronika bidez eta proiektu robotikoak, domotikoak, etxeko asmakizunak, eta abar gauzatzen ikasteko diseinatu da.","fr-FR":"On ne peut pas réaliser de jeux vidéo sur ordinateur, mais on peut réaliser des jeux en utilisant les composants électroniques de Mon premier kit de robotique ou d'autres composants compatibles avec la carte ZUM ou une carte compatible avec Arduino. Scratch a été conçu pour apprendre aux enfants à programmer en réalisant des jeux vidéo, alors que Bitbloq a été conçu pour apprendre aux enfants à programmer en utilisant l’électronique, et en réalisant des projets robotiques et domotiques, des inventions maison, etc.","gl":"Non poden facerse videoxogos no computador, pero os xogos utilizando a electrónica do meu Primeiro Kit de Robótica ou calquera outra electrónica que use a placa ZUM ou unha placa compatible con Arduino. Scratch foi diseado para ensinar aos nenos a programar realizando videoxogos, mentres que bitbloq foi diseado para ensinar aos nenos a programar usando electrónica e realizando proxectos robóticos, domótica, inventos caseiros, etc.","it-IT":"Non è possibile realizzare videogiochi nel computer; è possibile realizzarli, invece, tramite Il mio primo kit di robotica o qualsiasi altro strumento elettronico che usi la scheda ZUM o una scheda compatibile con Arduino. Scratch è stato pensato per insegnare ai bambini a programmare tramite la realizzazione di videogiochi, mentre Bitbloq è stato pensato per insegnare ai bambini a programmare tramite strumenti elettronici e realizzando progetti di robotica, domotica, invenzioni fai da te, ecc.\",","nl-NL":"Het is niet mogelijk om videogames op de computer, maar van eletronica uit de of andere eletronica  van ZUM of een ander board compatibl met Arduino. Scratch is ontworpen om kinderen te leren programmeren door videogames, Bitbloq ontworpen is te leren door  van eletronica, et creëren van roboticaprojecten, uitvindingen etc.","pt-PT":"Não é possível fazer videojogos no computador, mas sim jogos utilizando a eletrónica do Mi Primer Kit de Robótica ou qualquer outra eletrónica que utilize a placa ZUM ou uma placa compatível com Arduino. O Scratch foi concebido para ensinar às crianças a programar realizando videojogos, enquanto o Bitbloq foi concebido para ensinar às crianças a programar utilizando eletrónica e realizando projetos robóticos, domótica, invenções caseiras, etc.","ru-RU":"Вы не сможете создавать компьютерные игры, но сможете создавать игры, используя электронику из «Моего первого робототехнического набора» или любую другую электронику, использующую плату ZUM либо плату, совместимую с Arduino. Scratch был разработан для того, чтобы научить детей программированию путем создания видеоигр, в то время как Bitbloq – для обучения их программированию посредством использования электроники и реализации проектов в области робототехники, систем «умный дом», бытовых изобретений и т.д.","zh-CN":"不能做计算机游戏，但可以跟Mi Primer Kit de Robótica, ZUM板, Arduino板 做电子游戏。Scratch "},"order":9},{"title":{"ca-ES":"Política de privadesa","de-DE":"Datenschutzerklärung","en-GB":"Privacy Policy","es-ES":"Política de privacidad","eu-ES":"Pribatutasun politika","fr-FR":"Politique de confidentialité","gl":"Política de privacidade","it-IT":"Politica sulla privacy","nl-NL":"Privacy","pt-PT":"Política de privacidade","ru-RU":"Политика конфиденциальности","zh-CN":"隐私政策"},"content":{"ca-ES":"Les dades de caràcter personal proporcionades formaran part d'un fitxer del qual n'és responsable Mundo Reader, S.L., i que es gestionarà d'acord amb la normativa espanyola de protecció de dades amb la finalitat de poder oferir aquest servei als usuaris d'acord amb les condicions generals vigents. Consulteu la nostra política de privadesa a www.bq.com En crear un compte, l'usuari confirma que ha llegit i accepta les condicions de la política de privadesa. Si teniu qualsevol dubte respecte a la política o el tractament que fem de les vostres dades personals, contacteu amb lopd@bq.com","de-DE":"Die zur Verfügung gestellten persönlichen Daten sind Teil eines Ordners, dessen Verantwortlicher die Mundo Reader, S.L. ist und der gemäß den spanischen Datenschutzbedingungen verwaltet wird. Ziel ist es, den Nutzern diesen Service nach den geltenden Allgemeinen Bestimmungen anbieten zu können. Weitere Informationen finden sich in unserer Datenschutzerklärung unter www.bq.com. Mit dem Erstellen eines Kontos akzeptiert der Nutzer, dass er die Datenschutzbestimmungen gelesen hat und diesen zustimmt. Fragen zum Datenschutz oder zum Umgang mit persönlichen Daten bitte an lopd@bq.com.","en-GB":"The personal data that you provide will be included in a file owned and managed by Mundo Reader, S.L., pursuant to the Spanish data protections laws, for the purpose of providing this service to users, in accordance with the General Conditions currently in force. Consult our Privacy Policy at www.bq.com. By creating an account, the user acknowledges having read and accepted the terms and conditions of the Privacy Policy. If you have any doubts regarding this policy or the processing of your personal data, please write to lopd@bq.com","es-ES":"Los datos de carácter personal proporcionados formarán parte de un fichero cuyo responsable es Mundo Reader, S.L., el cual se gestiona conforme a la normativa española de protección de datos con la finalidad de poder prestar este servicio a los usuarios conforme a las condiciones generales vigentes. Consulte nuestra la política de privacidad en www.bq.com. Creándose una cuenta el usuario reconoce que ha leído y acepta las condiciones de la política de privacidad. Si tiene cualquier duda respecto a la política o el tratamiento que hacemos de sus datos personales, contacte con lopd@bq.com.","eu-ES":"Emandako datu pertsonalak Mundo Reader, S.L.-ren datu-base batean gordeko dira, datuak espainiar araudiaren arabera kudeatuko ditu, indarrean dauden baldintza orkorrak beteaz erabiltzaileei zerbitzua eskaini ahal izateko. Irakurri gure politika politika www.bq.com webgunean. Kontu bat sortuz erabiltzaileak pribatutasun politika irakurri eta onartzen dituela esan nahi du. Politika edo zure datu pertsonalen kudeaketari buruzko zalantzarik baduzu, jarri gurekin harremanetan lopd@bq.com helbidearen bitartez.","fr-FR":"Les données à caractère personnel fournies intègreront un fichier géré par Mundo Reader, S.L., conformément à la règlementation espagnole de protection des données, dans le but de pouvoir fournir ce service aux utilisateurs en accord avec les conditions générales en vigueur. Notre politique de confidentialité est à consulter sur www.bq.com. En créant un compte, l'utilisateur reconnaît qu'il a lu et accepté les conditions de la politique de confidentialité. Pour toute question au sujet de notre politique ou du traitement des données personnelles, envoyer un message à lopd@bq.com.","gl":"Os datos de carácter persoal proporcionados formarán parte dun ficheiro cuxo responsable é Mundo Reader, S.L., o cal se xestiona conforme á normativa española de protección de datos coa finalidade de poder prestar este servizo aos usuarios conforme ás condicións xerais vixentes. Consulte nosa a política de privacidade en www.bq.com. Creándose unha conta o usuario recoñece que leu e acepta as condicións da política de privacidade. Si ten calquera dúbida respecto de a política ou o tratamento que facemos dos seus datos persoais, contacte con lopd@bq.com.","it-IT":"I dati di carattere personale forniti fanno parte di un archivio di responsabilità di Mundo Reader, S.L., che viene gestito in conformità alla normativa spagnola sulla protezione dei dati al fine di garantire che il servizio sia conforme alle condizioni generali vigenti. Consulta la nostra politica sulla privacy all'indirizzo www.bq.com Creando un account, l'utente dichiara di aver letto e accettato le condizioni della politica sulla privacy. Per qualsiasi dubbio relativo alla politica o al trattamento dei dati personali, è possibile contattare lopd@bq.com.","nl-NL":"  ons privacybeleid op www.bq.com.  ","pt-PT":"Os dados de caráter pessoal proporcionados farão parte de um ficheiro cujo responsável é a Mundo Reader, S.L., sendo este gerido em conformidade com a regulamentação espanhola de proteção de dados, com a finalidade de prestar este serviço aos utilizadores de acordo com as condições gerais em vigor. Consulta a nossa política de privacidade em www.bq.com. Ao criar uma conta, o utilizador reconhece ter lido e aceite as condições da política de privacidade. Se tiveres qualquer dúvida em relação à política ou ao tratamento que fazemos dos seus dados pessoais, contacta com lopd@bq.com.","ru-RU":"Предоставленные пользователем персональные данные станут частью базы данных, ответственным оператором которой является компания Mundo Reader, S.L. и которая администрируется в соответствии с испанским законодательством о защите данных, с целью обеспечения возможности оказания этой услуги пользователям в соответствии с действующими Общими условиями. Вы можете ознакомиться с нашей политикой конфиденциальности на сайте www.bq.com. Создавая аккаунт, пользователь признает, что ознакомился с условиями политики конфиденциальности и принимает их. Если у вас возникли какие-либо вопросы касательно политики конфиденциальности или обращению с вашими персональными данными, вы можете задать их нам по электронной почте lopd@bq.com.","zh-CN":"提供的个人资料将成为Mundo Reader, S.L., 管理, 按照一般用户条件为西班牙保护法律。请参阅我们在 www.bq.com的隐私政策。创建一个帐户你确认已经阅读并接受隐私政策条款。如果你有关于政策或任何个人资料疑问, 请联系lopd@bq.com。"},"order":10},{"title":{"ca-ES":"Web2Board no s'obre a Windows","de-DE":"Web2Board lässt sich in Windows nicht öffnen.","en-GB":"Web2Board won´t open on Windows","es-ES":"Web2Board no se abre en Windows","eu-ES":"Web2Board ezin da ireki Windows-en.","fr-FR":"Web2Board ne s'ouvre pas dans Windows","gl":"eb2Board non se abre en Windows","it-IT":"Web2Board non si apre in Windows","nl-NL":"Web2Board opent niet in Windows","pt-PT":"O Web2Board não pode ser aberto no Windows","ru-RU":"Web2Board не открывается в Windows","zh-CN":"Web2Board法在Windows中打开"},"content":{"ca-ES":"Torna a instal·lar Web2Board com a administrador. Per fer-ho, fes clic amb el botó dret sobre l'executable i selecciona \"Executa’l com a administrador\".","de-DE":"Installiere Web2Board erneut als Administrator. Klicke hierfür mit der rechten Maustaste auf die ausführbare Datei und wähle \"Als Administrator ausführen\".","en-GB":"Reinstall Web2Board as administrator. To do this, right-click the executable file and select the option \"Run as administrator\"","es-ES":"Reinstala Web2Board como administrador. Para ello haz click derecho sobre el ejecutable y selecciona \"Ejecutar como administrador\".","eu-ES":"Berriz instalatu Web2Board administratzaile gisa. Horretarako, egin klik saguaren eskuineko botoiarekin eta hautatu \"Exekutatu administratzaile gisa\".","fr-FR":"Réinstalle Web2Board en tant qu'administrateur. Pour cela, fais un clic droit sur l'exécutable et sélectionne « Exécuter en tant qu'administrateur ».","gl":"Reinstala Web2Board como administrador. Para iso fai click dereito sobre o ejecutable e selecciona \"Executar como administrador\".","it-IT":"Reinstalla Web2Board come amministratore. A tal fine, fai clic con il tasto destro sul file eseguibile e seleziona \"Esegui come amministratore\".","nl-NL":"Installeer Web2Board opnieuw als administrator. ","pt-PT":"Reinstala o Web2Board como administrador. Para isso, clica direito no executável e seleciona \"Executar como administrador\".","ru-RU":"Переустановите Web2Board с правами администратора. Для этого кликните правой кнопкой мыши на исполняемом файле и выберите «Выполнить с правами администратора».","zh-CN":"为管理员安装Web2Board。请按和选择“以管理员身份运行”。"},"order":11},{"title":{"ca-ES":"No puc iniciar la sessió a Bitbloq","de-DE":"Ich kann mich nicht bei Bitbloq anmelden.","en-GB":"I can´t log in to Bitbloq","es-ES":"No puedo iniciar sesión en Bitbloq","eu-ES":"Ezin dut saioa hasi bitbloq-en.","fr-FR":"Je n'arrive pas ouvrir ma session Bitbloq","gl":"Non podo iniciar sesión en Bitbloq","it-IT":"Non riesco ad avviare la sessione in Bitbloq","nl-NL":"Ik kan niet inloggen op Bitbloq","pt-PT":"No posso iniciar sessão no Bitbloq","ru-RU":"Не могу начать сессию на Bitbloq","zh-CN":"无法登录Bitbloq"},"content":{"ca-ES":"Comprova si la data i l'hora del teu ordinador són correctes. Si no és així, corregeix-les i torna-ho a provar.","de-DE":"Überprüfe, ob das Datum und die Uhrzeit in deinem Computer richtig sind. Ist dies nicht der Fall, korrigiere sie zunächst und versuche es dann erneut.","en-GB":"Check that your computer's time and date are correct. If not, change them and try again.","es-ES":"Comprueba si la fecha y hora de tu ordenador son correctas. Si no es así, corrígelas y prueba de nuevo.","eu-ES":"Egiaztatu ordenagailuko eguna eta ordua ongi dauden. Hala ez bada, zuzen itzazu eta berriro egiaztatu.","fr-FR":"Regarde si la date et l'heure affichées par ton ordinateur sont correctes. Si ce n'est pas le cas, corrige-les puis réessaie.","gl":"Comproba si a data e hora do teu computador son correctas. Si non é así, corríxelas e proba de novo.","it-IT":"Verifica se data e ora del tuo computer sono corrette. Diversamente, correggile e prova di nuovo.","nl-NL":"Controleer de datum en van je computer correct zijn. pas ze dan aan en probeer het opnieuw.","pt-PT":"Verifica se a data e hora do teu computador estão corretas. Se não for o caso, corrige-as e tenta novamente.","ru-RU":"Проверьте, правильно ли ваш компьютер отображает дату и время. Если нет, исправьте их и попробуйте еще раз.","zh-CN":"请检查计算机的日期和时间是否正确。如果不是，则更正它们，然后重试。"},"order":12},{"title":{"ca-ES":"Els blocs que estan solts no generen codi","de-DE":"Die einzelnen Blöcke generieren keinen Code.","en-GB":"The unconnected blocks do not generate code","es-ES":"Los bloques que están sueltos no generan código","eu-ES":"Solte dauden blokeek ez dute koderik sortzen.","fr-FR":"Les blocs isolés ne génèrent pas de code","gl":"Os bloques que están soltos non xeran código","it-IT":"I blocchi scollegati non generano codice","nl-NL":"De blokken genereren geen code","pt-PT":"Os blocos soltos não geram código","ru-RU":"Несвязанные блоки не генерируют код","zh-CN":"松动的块不会生成代码"},"content":{"ca-ES":"La nova estructura de programació de Bitbloq 2 està pensada de tal forma que has de connectar els blocs a algun bloc de projecte (\"Variables globals i funcions\", \"Instruccions inicials (Setup)\" o Bucle principal (Loop)\") Els bucles que no estiguin connectats no generaran codi i per tant no tindran efecte a la placa o robot.","de-DE":"Die neue Programmierstruktur von Bitbloq 2 ist so gedacht, dass du die Blöcke mit einem der Blöcke der Projekte verbinden musst (\"Globale Variablen und Funktionen\", \"Initialanweisungen (Setup)\" oder \"Hauptschleife (Loop)\"). Jeder Block, der nicht verbunden ist, generiert auch keinen Code und man sieht daher auch keine Auswirkung auf die Platine oder den Roboter.","en-GB":"The new programming structure of Bitbloq 2 has been developed in such a way that your blocks need to be connected to a project block (\"Global variables and functions\", \"Setup\" or \"Loop\"). Unconnected blocks will not generate any code.","es-ES":"La nueva estructura de programación de Bitbloq 2 está pensada de tal forma que debes conectar los bloques a algún bloque de proyecto (\"Variables globales y funciones\", \"Instrucciones iniciales (Setup)\" o \"Bucle principal (Loop)\"). Cualquier bloque no conectado no generará código y por tanto no se verá su efecto en la placa o robot.","eu-ES":"bitbloq 2 programazio-egitura berria proiektu-blokeak elkarrekin konektatzeko dago pentsatuta (\"Aldagai orokorrak eta funtzioak\", \"Hasierako argibideak (Setup)\" edo \"Begizta nagusia (Loop)\"). Konektatu gabeko blokeek ez dute koderik sortuko eta, ondorioz, ez dute eraginik izango plakan edo robotean.","fr-FR":"Avec la nouvelle structure de programmation de Bitbloq 2, tu dois connecter les blocs à un bloc de projet (Variables globales et fonctions, Instructions de départ (Setup) ou Boucle (Loop)). Si un bloc est isolé, il ne génèrera pas de code et par conséquent il n'aura pas d'effet sur la carte ou le robot.","gl":"A nova estrutura de programación de Bitbloq 2 está pensada de tal forma que debes conectar os bloques a algún bloque de proxecto (\"Variables globais e funcións\", \"Instrucións iniciais (Setup)\" ou \"Bucle principal (Loop)\"). Calquera bloque non conectado non xerará código e xa que logo non se verá o seu efecto na placa ou robot.","it-IT":"La nuova struttura di programmazione di Bitbloq 2 è pensata in modo tale che occorre collegare i blocchi a qualche blocco del progetto (\"Variabili globali e funzioni\", \"Istruzioni iniziali (Setup)\" o \"Loop principale (Loop)\"). Ogni blocco non collegato non genererà codice e pertanto non se ne vedrà l'effetto sulla scheda o sul robot.","nl-NL":"nieuwe  is ontwikkeld dat je blokken moet een projectblok . blokken  geen code.","pt-PT":"A nova estrutura de programação do Bitbloq 2 está pensada de tal forma que é preciso conectar os blocos a algum bloco de projeto (\"Variáveis globais e funções\", \"Instruções iniciais (Setup)\" ou \"Circuito principal (Loop)\"). Qualquer bloco não conectado não gera código e portanto não se verás o seu efeito na placa ou robot.","ru-RU":"Новая структура программирования на Bitbloq 2 задумана таким образом, что вам необходимо связать блоки с каким-нибудь блоком проекта («Глобальные переменные и функции», «Начальные инструкции (Setup)» или «Главный цикл (Loop)»). Если блок не связан, он не будет генерировать код и, соответственно, его эффект не будет виден на плате или роботе.","zh-CN":"新的Bitbloq2设计编程结构，使您连接块（“全局变量和函数”，“最初的指令（Setup）”或“主循环（Loop）”）。未连接任何模块不会生成代码，因此不会在板或机器人。"},"order":13},{"title":{"ca-ES":"Els blocs que estan solts han desaparegut del meu projecte","de-DE":"Die einzelnen Blöcke sind aus meinem Programm verschwunden.","en-GB":"The blocks that are not connected have disappeared from my project","es-ES":"Los bloques que están sueltos han desaparecido de mi proyecto","eu-ES":"Solte dauden blokeak nire proiektutik desagertu dira","fr-FR":"Les blocs isolés ont disparu de mon projet","gl":"Os bloques que están soltos desapareceron do meu proxecto","it-IT":"I blocchi scollegati sono scomparsi dal mio progetto","nl-NL":"De blokken zijn uit mijn project","pt-PT":"Os blocos que estão soltos desapareceram do meu projeto","ru-RU":"Несвязанные блоки исчезли из моего проекта","zh-CN":"这些块从我的项目已经消失"},"content":{"ca-ES":"La nova estructura de programació de Bitbloq 2 està pensada de tal manera que has de connectar els blocs a algun bloc de projecte (\"Variables globals i funcions\", \"Instruccions inicials (Setup)\" o Bucle principal (Loop)\") Els blocs que no estiguin connectats no es desaran al projecte.","de-DE":"Die neue Programmierstruktur von Bitbloq 2 ist so gedacht, dass du die Blöcke mit einem der Blöcke der Projekte verbinden musst (\"Globale Variablen und Funktionen\", \"Initialanweisungen (Setup)\" oder \"Hauptschleife (Loop)\"). Ein Block, der nicht verbunden wurde, wird nicht im Projekt gespeichert.","en-GB":"The new programming structure of Bitbloq 2 has been developed in such a way that your blocks need to be connected to a project block (\"Global variables and functions\", \"Setup\" or \"Loop\"). Unconnected blocks will not be stored in the project.","es-ES":"La nueva estructura de programación de Bitbloq 2 está pensada de tal forma que debes conectar los bloques a algún bloque de proyecto (\"Variables globales y funciones\", \"Instrucciones iniciales (Setup)\" o \"Bucle principal (Loop)\"). Cualquier bloque no conectado no se guardará en el proyecto.","eu-ES":"bitbloq 2 programazio-egitura berria proiektu-blokeak elkarrekin konektatzeko dago pentsatuta (\"Aldagai orokorrak eta funtzioak\", \"Hasierako argibideak (Setup)\" edo \"Begizta nagusia (Loop)\"). Konektatu gabeko blokeak ez dira proiektuan gordeko.","fr-FR":"Avec la nouvelle structure de programmation de Bitbloq 2, tu dois connecter les blocs à un bloc de projet (Variables globales et fonctions, Instructions de départ (Setup) ou Boucle (Loop)). Les blocs isolés disparaîtront du projet.","gl":"A nova estrutura de programación de Bitbloq 2 está pensada de tal forma que debes conectar os bloques a algún bloque de proxecto (\"Variables globais e funcións\", \"Instrucións iniciais (Setup)\" ou \"Bucle principal (Loop)\"). Calquera bloque non conectado non se gardará no proxecto.","it-IT":"La nuova struttura di programmazione di Bitbloq 2 è pensata in modo tale che occorre collegare i blocchi a qualche blocco del progetto (\"Variabili globali e funzioni\", \"Istruzioni iniziali (Setup)\" o \"Loop principale (Loop)\"). Ogni blocco non collegato non sarà salvato nel progetto.","nl-NL":"nieuwe  is ontwikkeld dat je blokken moet een projectblok . Niet blokken worden niet opgeslagen.","pt-PT":"A nova estrutura de programação do Bitbloq 2 está pensada de tal forma que é preciso conectar os blocos a algum bloco de projeto (\"Variáveis globais e funções\", \"Instruções iniciais (Setup)\" ou \"Circuito principal (Loop)\"). Qualquer bloco não conectado não será guardado no projeto.","ru-RU":"Новая структура программирования на Bitbloq 2 задумана таким образом, что вам необходимо связать блоки с каким-нибудь блоком проекта («Глобальные переменные и функции», «Начальные инструкции (Setup)» или «Главный цикл (Loop)»). Любой несвязанный блок не будет сохранен в проекте.","zh-CN":"新的Bitbloq2设计编程结构，使您连接块（“全局变量和函数”，“最初的指令（Setup）”或“主循环（Loop）”）。未连接任何模块不会被保存在项目中。"},"order":14},{"title":{"ca-ES":"Per què no poden crear-se un compte els menors de 14 anys?","de-DE":"Warum kann man sich erst ab 14 Jahren ein Konto erstellen?","en-GB":"Why can´t children under 14 years old create an account?","es-ES":"¿Por qué no pueden crearse una cuenta los menores de 14 años?","eu-ES":"Zergatik ezin dute 14 urtetik beherakoek kontua sortu?","fr-FR":"Pourquoi les enfants de moins de 14 ans ne peuvent pas se créer un compte ?","gl":"¿Por qué non poden crearse unha conta os menores de 14 anos?","it-IT":"Perché i minori di 14 anni non possono creare un account?","nl-NL":"Waarom kinderen 14 jaar geen account aanmaken?","pt-PT":"Porque é que as crianças de menos de 14 anos não se podem criar uma conta?","ru-RU":"Почему не могут создать аккаунт несовершеннолетние младше 14 лет?","zh-CN":"为什么低于14岁不能创建一个帐户？"},"content":{"ca-ES":"Degut a la Llei Orgànica de Protecció de Dades de Caràcter Personal, per tal que un menor de 14 anys pugui crear-se un compte, necessitem tenir el permís explícit del pare/mare/tutor, els quals ens han de proporcionar extensa documentació. Per aquest motiu no els podem permetre la creació de comptes d'usuari. Hauran d'utilitzar comptes d'usuari creades per un usuari major de 14 anys i utilitzar Bitbloq acompanyats d'aquesta persona.","de-DE":"Laut Gesetz zum Schutz persönlicher Daten würden wir, damit sich ein Kind unter 14 Jahren ein Konto erstellen kann, die ausdrückliche Erlaubnis des Vaters/Mutters/Lehrers benötigen, und diese müsste umfangreich dokumentiert werden. Daher können wir ihnen nicht erlauben, sich ein Nutzerkonto zu erstellen, sondern sie müssen ein Konto verwenden, dass von einer Person über 14 Jahre erstellt worden ist und dieses gemeinsam mit dieser Person verwenden.","en-GB":"Due to the Spanish law \"Ley Orgánica de Protección de Datos de Carácter Personal\",  we would need an explicit permit from the father, mother or legal guardian in order to create an account. Because of this, we cannot allow them to create accounts. Instead, they must use an account owned by somebody older than 14, and be supervised by the latter when doing so.","es-ES":"Debido a la Ley Orgánica de Protección de Datos de Carácter Personal, para que un menor de 14 años pueda crearse una cuenta, deberíamos de tener permiso explícito del padre/madre/tutor, y estos proporcionarnos extensa documentación. Por esa razón no podemos permitir que se creen cuentas de usuario, sino que tendrán que utilizar cuentas de usuario creadas por usuarios mayores de 14 años y usar Bitbloq acompañados de dicha persona.","eu-ES":"Datu Pertsonalak Babesteko Lege Organikoa dela eta, 14 urtetik beherakoek kontu bat sortu ahal izateko, aitaren, amaren edo tutorearen baimena beharko genuke, eta hauek dokumentu ugari bidali beharko lizkigukete. Horregatik, ezin dugu 14 urtetik beherakoek kontuak sortzea onartu, aldiz, 14 urtetik gorakoek sortutako kontuak erabili beharko dituzte eta bitbloq haien konpainian erabili.","fr-FR":"Conformément à la loi organique espagnole de protection des données à caractère personnel, pour qu'un enfant de moins de 14 ans puisse se créer un compte, nous devons obtenir l'accord explicite de ses parents ou de son tuteur, et ces derniers doivent nous fournir des papiers détaillés. C'est pourquoi nous ne pouvons pas laisser des enfants de moins de 14 ans se créer de compte utilisateur. Ils devront utiliser un compte créé par un utilisateur de plus de 14 ans et ce sous la supervision de ce dernier.","gl":"Debido á Lei Orgánica de Protección de Datos de Carácter Persoal, para que un menor de 14 anos poida crearse unha conta, deberiamos de ter permiso explícito do pai/nai/titor, e estes proporcionarnos extensa documentación. Por esa razón non podemos permitir que se creen contas de usuario, senón que terán que utilizar contas de usuario creadas por usuarios maiores de 14 anos e usar Bitbloq acompañados de devandita persoa.","it-IT":"A causa della Legge sulla Protezione dei dati personali, affinché un minore di 14 anni possa creare un account, occorre avere il consenso esplicito del pade/madre/tutore, che deve inviarci anche l'opportuna documentazione. Per tale ragione, i minori non possono creare account personali, ma dovranno utilizzare account creati da utenti con età superiore a 14 anni, e utilizzare Bitbloq accompagnati da tale persona.","nl-NL":"de Spaanse om een account aan te maken. kunnen weniet toestaan accounts aanmaken. Zij kunnen beter gebruikmaken van een account van iemand die ouder is dan 14, en .","pt-PT":"Devido à lei orgânica de proteção de dados de caráter pessoal, para que um menor de 14 anos pudesse criar uma conta, devíamos ter a autorização explícita do pai/mãe/tutor, e estes nos fornecerem uma extensa documentação. Por essa razão, não podemos permitir que criem contas de utilizador mas apenas que utilizem contas de utilizadores criadas por pessoas de mais de 14 anos e utilizar o Bitbloq acompanhados dessa pessoa.","ru-RU":"В соответствии с Конституционным законом Испании о защите персональных данных, для того чтобы несовершеннолетний младше 14 лет мог создать себе аккаунт, нам необходимо явно выраженное разрешение одного из его родителей/законных представителей, при условии направления ими соответствующих документов с необходимыми данными. По этой причине мы не можем разрешить лицам моложе 14 лет создавать пользовательские аккаунты, им необходимо будет использовать аккаунты, созданные лицом старше 14 лет, и пользоваться Bitbloq в сопровождении указанного лица.","zh-CN":"由于个人数据保护组织法，14岁以下的孩子不可以创建一个帐户，除非父亲/母亲/监护人提供大量明确许可文档。他们必须使用超过14岁的帐户，而使用Bitbloq时有哪个人伴随。"},"order":15},{"title":{"ca-ES":"No em detecta la placa","de-DE":"Die Platine wird nicht erkannt.","en-GB":"The board is not being detected","es-ES":"No me detecta la placa","eu-ES":"Ez du nire plaka detektatzen","fr-FR":"Ma carte contrôleur n'est pas détectée","gl":"Non me detecta a placa","it-IT":"La mia scheda non viene rilevata","nl-NL":"Het board wordt niet gedetecteerd","pt-PT":"Não deteta a minha placa","ru-RU":"Моя плата не обнаруживается","zh-CN":"没有检测到板"},"content":{"ca-ES":"Poden existir diversos problemes que fan que no es detecti la placa. A continuació te’n posem uns exemples. Prova'ls, i si tot i així segueix sense detectar-se, envia'ns un missatge.\n1.- Si la placa és “zum”, comprova que l'interruptor estigui en \"ON\"\n2.- Desconnecta tots els components connectats i intenta tornar a pujar el programa.\n3.- Desconnecta l'USB de la placa i torna'l a connectar.\n4.- Prem el botó “reset” de la placa mentre prems \"carrega\" Deixa'l anar just abans que comenci a programar la placa","de-DE":"Es kann verschiedene Gründe haben, warum die Platine nicht erkannt wird. Hier listen wir dir einige davon auf. Gehe sie durch und sende uns eine Nachricht, wenn sie dennoch nicht erkannt werden sollte.\n1.- Wenn es sich um eine ZUM-Platine handelt, überprüfe, dass sich der Schalter in der \"ON\"-Stellung befindet\n2.- Trenne alle Komponenten und versuche erneut, das Programm zu laden\n3.- Löse das USB-Kabel von der Platine und verbinde sie erneut\n4.- Drücke die Reset-Taste der Platine während du auf \"laden\" klickst. Lass die Taste kurz bevor die Programmierung der Platine beginnt los.","en-GB":"The board may not be detected for different reasons. Try the solutions listed below:\n1.- If the board you are using is a Zum, check that the switch is \"ON\".\n2.- Disconnect all the hardware components that could be connected and try to upload the program again.\n3.- Disconnect the board from the computer and connect it again. \n4.- Press the reset button when clicking on \"Load\". Release the reset button just before the programming starts.","es-ES":"Puede haber distintos problemas por los cuales no se detecta la placa. Aquí te listamos algunos. Pruébalos y si sigues sin que se te detecte, envíanos un mensaje.\n1.- Si la placa es una zum, comprueba que el interruptor está en \"ON\"\n2.- Desconecta todos los componentes conectados y prueba a subir el programa de nuevo\n3.- Desconecta el usb de la placa y vuelve a conectarla\n4.- Aprieta el botón de reset de la placa mientras le das a \"cargar\". Suéltalo justo antes de que comience a programar la placa","eu-ES":"Hainbat arrazoi daude plaka detektatu ahal ezizateko. Hemen dituzu batzuk. Proba itzazu eta detektatu ezinda jarraitzen baduzu, bidali iezaguzu mezu bat.\n1.- Plaka zum bat bada, egiaztatu etengailua \"ON\" posizioan dagoela\n2.- Konektatuta dauden osagai guztiak deskonektatu eta saiatu programa berriro igotzen\n3.- usb-a plakatik deskonektatu eta berriro konektatu\n4.- Sakatu plakaren \"reset\" botoia \"kargatu\" sakatzen duzun bitartean. Aska ezazu plaka programatzen hasi aurretik","fr-FR":"Ce problème peut avoir différentes causes. Voici quelques possibilités. Si le problème persiste, écris-nous.\n1.- Si tu utilises une carte ZUM, vérifie que l'interrupteur est sur la position ON.\n2.- Déconnecte tous les composants connectés et réessaie de charger le programme\n3.- Débranche le câble USB de la carte puis rebranche-le.\n4.- Appuie sur le bouton reset de ta carte tout en cliquant sur Charger. Relâche le bouton juste avant que ne démarre la programmation de la carte.","gl":"Pode haber distintos problemas polos cales non detectar a placa. Aquí che listamos algúns. Próbaos e si segues sen que se che detecte, envíanos unha mensaxe.\n1.- Si a placa é unha zum, comproba que o interruptor está en \"ON\"\n2.- Desconecta todos os compoñentes conectados e proba a subir o programa de novo\n3.- Desconecta o usb da placa e volve conectala\n4.- Aperta o botón de reset da placa mentres lle dás a \"cargar\". Sóltao xusto antes de que comece a programar a placa","it-IT":"Possono esserci vari problemi per cui la scheda non viene rilevata. Eccone alcuni. Verificali e, se il problema continua, inviaci un messaggio.\n1.- Se si tratta di una scheda zum, verifica che l'interruttore sia su \"ON\"\n2.- Scollega tutti i componenti collegati e prova a caricare nuovamente il programma\n3.- Scollega il dispositivo usb dalla scheda e ricollegalo\n4.- Premi il pulsante di reset della scheda mentre avvii il \"caricamento\". Scollegalo appena prima che cominci a programmare la scheda","nl-NL":"verschillende redenen niet gedetecteerd. Probeer onderstaande oplossingen. \\ N1.-  \\ n2.- oppel alle hardwarecomponenten  en probeer het programma opnieuw te uploaden. \\ n3.- Koppel het board van de computer en sluit het weer. \\ N4.- Houd de resetknop ingedrukt en klik op \"\". Laat de resetknop los voordat de programmering .","pt-PT":"Podem existir diferentes problemas que expliquem a não deteção da placa. Apresentamos alguns a seguir. Experimenta e se o problema persistir, envia-nos uma mensagem\n1.- Se a placa for uma zum, verifica se o interruptor está em \"ON\"\n2.- Desconecta todos os componentes conectados e tenta carregar novamente o programa\n3.- Desconecta o usb da placa e volte a conectá-la\n4.- Carrega no botão de reset da placa e clica ao mesmo tempo em \"carregar\". Solta-o imediatamente antes de começares a programar a placa","ru-RU":"Причины, по которым плата не обнаруживается, могут быть различными. Здесь мы приведем некоторые из них. Попробуйте эти варианты, и если плата по-прежнему не будет обнаруживаться, отправьте нам сообщение.\n1.- Если это ZUM-плата, проверьте, проверьте, стоит ли выключатель в положении «Вкл.»\n2.- Отсоедините все подключенные компоненты и попробуйте загрузить программу снова\n3.- Отключите USB от платы и снова подключите ее.\n4.- Нажмите кнопку перезагрузки на плате в процессе «загрузки» на нее. Отпустите ее непосредственно перед тем, как начнете программировать плату.","zh-CN":"板可能检测到的各种问题。我们列出一些在这里。试试吧，如果你仍然无法检测,请发送邮件。\n1.-如果该本是Zum,请检查开关置于“ON”\n2.-切断连接的部件，并再次测试程序\n3.-拔下USB板并重新连接\n4.- 压复位按钮，同时也压“负载”。编程板之前放开它"},"order":16},{"title":{"ca-ES":"A la bq ZUM, no se m'engega l'LCD.","de-DE":"Die LCD der BQ ZUM schaltet sich nicht ein.","en-GB":"The LCD is not showing anything in the BQ Zum board","es-ES":"No se enciende el LCD cuando se conecta a la bq ZUM","eu-ES":"ZUM bq-an ez zait LCD-a pizten.","fr-FR":"L'écran LCD ne s'allume pas avec ma BQ ZUM","gl":"Non se acende o LCD cando se conecta á bq ZUM","it-IT":"Nella bq ZUM, non si accende l'LCD","nl-NL":"Het LCD-scherm het bq ZUM board","pt-PT":"Na bq ZUM, o LCD não acende","ru-RU":"На плате bq ZUM не загорается жидкокристаллический дисплей","zh-CN":"当连接到BQ ZUM上液晶不懂"},"content":{"ca-ES":"Assegura't que el botó “on/off” de la placa està connectat, perquè si no ho està, els components senzills sí que funcionen, però els que necessiten més potència, no funcionaran.","de-DE":"Vergewissere dich, dass die on/off-Taste der Platine verbunden ist. Ist dies nicht der Fall, funktionieren zwar die einfacheren Komponenten, aber diejenigen, die mehr Leistung benötigen, funktionieren nicht.","en-GB":"Check that the switch on the board is \"ON\". If it is \"OFF\", some components may work, whereas others that need higher current will not.","es-ES":"Asegúrate de que el botón on/off de la placa está en posición on, de lo contrario, los componentes sencillos sí funcionarán, pero aquellos componentes que necesiten mayor potencia, no funcionarán.","eu-ES":"Egiaztatu plakaren on/off botoia konektatuta dagoela. Bestela, osagai sinpleak funtzionatuko dute, baina potentzia gehiago behar duten osagaiek ez.","fr-FR":"Vérifie que le bouton ON/OFF de ta carte est sur ON. Dans le cas contraire les composants de base fonctionnent mais ce n'est pas le cas des composants nécessitant plus de puissance.","gl":"Asegúrache de que o botón on/off da placa está en posición on, pola contra, os compoñentes sinxelos si funcionarán, pero aqueles compoñentes que necesiten maior potencia, non funcionarán.","it-IT":"Assicurati che il pulsante ON/OFF della scheda sia collegato: in caso contrario, i componenti semplici funzioneranno, ma non quelli che necessitino di una maggiore potenza.","nl-NL":"Controleer of de schakelaar op het bord in de stand \"ON\" staat. Als het \"\" staat, sommige onderdelen werken, andere die meer stroom nodig hebben niet.","pt-PT":"Verifica que o botão on/off da placa está conectado, no caso contrário, os componentes simples funcionam, mas os componentes que precisam de mais potência não.","ru-RU":"Удостоверьтесь, что кнопка вкл./выкл. на плате подключена, в противном случае простые компоненты будут работать, те же, которым требуется больше мощности, работать не будут.","zh-CN":"请确保在板的开/关按钮处于开的位置，否则，简单的组件会通,但那些需要更多的电力，组件无法正常工作。"},"order":17},{"title":{"ca-ES":"No puc accedir a Google Plus amb Chrome.","de-DE":"Ich kann mich mit Chrome nicht über Google plus anmelden.","en-GB":"I can´t log in via Google Plus on Chrome","es-ES":"No me deja acceder por Google plus con Chrome","eu-ES":"Ez dit uzten Chrome-rekin Google plus bitartez sartzen.","fr-FR":"Chrome ne me laisse pas me connecter via Google plus","gl":"Non me deixa acceder por Google plus con Chrome","it-IT":"Non riesco ad accedere a Google plus con Chrome","nl-NL":"I kan niet inloggen via Google met Chrome","pt-PT":"Não consigo aceder através de Google plus com Chrome","ru-RU":"У меня не получается зайти через Google plus в браузере Chrome","zh-CN":"我不能跟Chrome 进如到Google plus "},"content":{"ca-ES":"Actualitza Chrome a la darrera versió. Si té actualitzacions pendents, és possible que no hi puguis accedir.","de-DE":"Aktualisiere Chrome auf die neueste Version. Bei ausstehenden Aktualisierungen ist möglicherweise kein Zugriff möglich.","en-GB":"Update Chrome to the latest version. If there are any updates pending, you may not be able to log in.","es-ES":"Actualiza Chrome a la última versión, ya que si tiene actualizaciones pendientes, es posible que no te deje acceder.","eu-ES":"Chrome bertsioa eguneratu, eguneraketak egiteke baditu, baliteke sartzen ez uztea.,","fr-FR":"Mets à jour Chrome. Si tu as des mises à jour en attente, il est possible que tu n'arrives pas à te connecter.","gl":"Actualiza Chrome á última versión, xa que si ten actualizacións pendentes, é posible que non che deixe acceder.","it-IT":"Aggiorna Chrome all'ultima versione: se ci sono degli aggiornamenti in sospeso, è possibile che tu non riesca ad accedere. ","nl-NL":"Update Chrome naar de .  Chrome updates klaarstaan  het mogelijk je .","pt-PT":"Atualiza o Chrome para a última versão, uma vez que tem atualizações pendentes, é possível que não te deixe aceder.","ru-RU":"Обновите Chrome до последней версии, поскольку если у вас не самое последнее обновление, то возможно, что вам не удастся зайти.","zh-CN":"请升级Chrome到最新版本。如果有更新的版本，它不会让你访问。"},"order":18},{"title":{"ca-ES":"Com es connecta l'LCD a la placa?","de-DE":"Wie verbindet man die LCD mit der Platine?","en-GB":"How can I connect the LCD to the board?","es-ES":"¿Cómo se conecta el LCD a la placa?","eu-ES":"Nola konektatzen da LCDa plakara?","fr-FR":"Comment dois-je connecter l'écran LCD à la carte ?","gl":"¿Cómo conectase o LCD a la placa?","it-IT":"Come si collega l'LCD alla scheda?","nl-NL":"Hoe kan ik de LCD aansluiten op het board?","pt-PT":"Como conectar o LCD à placa?","ru-RU":"Как подключить жидкокристаллический дисплей к плате?","zh-CN":"如何连接到液晶板？"},"content":{"ca-ES":"Has de connectar el cable de SCL al pin \"S\" analògic que s’indica a Bitbloq (a una bq ZUM, s’hauria de connectar al pin blau A5), després el cable SDA al pin \"S\" analògic  (a una bq ZUM seria el pin blau A4). El pin VCC es connecta a qualsevol pin analògic \"V\" i el pin GND es connecta a qualsevol pin analògic \"G\".","de-DE":"Du musst die Taktleitung SCL mit dem in Bitbloq angegebenen analogen Pin \"S\" verbinden (bei einer BQ ZUM wäre dies der blaue Pin A5), anschließend die Datenleitung SDA mit dem in Bitbloq angegebenen analogen Pin \"S\" (bei einer BQ ZUM wäre dies der blaue Pin A4).\nDer Pin VCC kann mit jedem analogen Pin \"V\" verbunden werden und der Pin GDN mit jedem analogen Pin \"G\".","en-GB":"Connect the SCL cable and the SDA cable to the \"S\" analogue pins that are shown in Bitbloq. \nThe VCC pin is connected to any \"V\" analogue pin and the GND pin to any \"G\" analogue pin.","es-ES":"Tienes que conectar el cable de SCL al pin \"S\" analógico indicado en Bitbloq (en una bq ZUM, sería conectarlo al pin azul A5), después el cable SDA, en el pin \"S\" analógico indicado en Bitbloq (en una bq ZUM, sería en el pin azul A4).\nEl pin VCC se conecta a cualquier pin analógico \"V\" y el pin GND se conecta a cualquier pin analógico \"G\".","eu-ES":"SCL kablea bitbloq-en adierazitako \"S\" pin analogikora konektatu behar duzu (ZUM bq batean, A5 pin urdinera konektatu beharko litzateke). Gero, SDA kablea bitbloq-en adierazitako \"S\" pin analogikora (ZUM bq batean A4 pin urdina izango litzateke).\nVCC pina edozein \"V\" pin analogikora konektatzen da eta GND pina edozein \"G\" pin analogikora. ","fr-FR":"Connecte le câble SCL à la broche analogique S indiquée sur Bitbloq (dans le cas d'une BQ ZUM, il s'agit de la broche bleue A5), puis le câble SDA à la broche analogique S indiquée sur Bitbloq (dans le cas d'une BQ ZUM, il s'agit de la broche bleue A4).\nTu peux connecter la broche VCC à n'importe quelle broche analogique V et tu peux connecter la broche GND à n'importe quelle broche analogique G.","gl":"Tes que conectar o cable de SCL ao pin \"S\" analóxico indicado en Bitbloq (nunha bq ZUM, sería conectalo ao pin azul A5), despois o cable SDA, no pin \"S\" analóxico indicado en Bitbloq (nunha bq ZUM, sería no pin azul A4).\nO pin VCC conéctase a calquera pin analóxico \"V\" e o pin GND conéctase a calquera pin analóxico \"*G\".","it-IT":"Devi collegare il cavo SCL al pin \"S\" analogico indicato in Bitbloq (in una bq ZUM, bisognerebbe collegarlo al pin blu A5), poi il cavo SDA al pin \"S\" analogico indicato in Bitbloq (in una bq ZUM, bisognerebbe collegarlo al pin blu A4).\nIl pin VCC si collega a qualsiasi pin analogico \"V\" e il pin GND a qualsiasi pin analogico \"G\".","nl-NL":"Sluit de SCL en de SDAkabel aan op de analoge pinnen die worden weergegeven in Bitbloq. \n .","pt-PT":"Conecta o cabo de SCL ao pino \"S\" analógico indicado no Bitbloq (numa bq ZUM, seria conectá-lo ao pino azul A5), a seguir, o cabo SDA no pino \"S\" analógico indicado no Bitbloq (numa bq ZUM, seria no pino azul A4).\\No pino VCC é possível conectar qualquer pino analógico \"V\" e o pino GND pode ser conectado a qualquer pino analógico \"G\".","ru-RU":"Вам необходимо подключить кабель SCL к указанному на Bitbloq аналоговому выходу «S» (в случае с платой bq ZUM следует подключить его к выходу A5 синего цвета), затем подключить кабель SDA к указанному на Bitbloq аналоговому выходу «S» (в случае с платой bq ZUM это будет синий выход A4).\nВыход VCC подключается к любому аналоговому выходу «V», а выход GND – любому аналоговому выходу «G».","zh-CN":"你必须连接线SCL引脚“S”模拟显示在Bitbloq(在BQ ZUM ，将连接蓝针A5), 然后在销的“S”模拟的SDA电缆指出Bitbloq(在BQ ZUM ，将连接蓝针A4)。\nVCC引脚连接到任何“V”模拟针和GND引脚连接到任何“G”模拟针。"},"order":19},{"title":{"ca-ES":"La placa LCD mostra caràcters estranys.","de-DE":"Auf der LCD-Anzeige erscheinen seltsame Zeichen ","en-GB":"The LCD is showing strange characters","es-ES":"La placa LCD me muestra caracteres raros","eu-ES":"LCD plakak karaktere arraroak erakusten dizkit","fr-FR":"L'écran LCD affiche de drôles de caractères ","gl":"A placa LCD móstrame caracteres raros","it-IT":"La scheda LCD visualizza caratteri strani","nl-NL":"Het LCD geeft rare tekens weer","pt-PT":"Aparecem caráteres estranhos na placa LCD","ru-RU":"Жидкокристаллический дисплей на плате показывает странные символы","zh-CN":"液晶显示屏上显示一些奇怪的字符板"},"content":{"ca-ES":"Hi ha dues possible causes que poden fer que l'LCD mostri caràcters estranys en lloc dels que hem programat: \n1.- L'LCD no accepta l'escriptura d'alguns caràcters especials com ara \"¡\", \"¿\" o \"ñ\", o de caràcters accentuats. Si els fem servir, apareixeran caràcters estranys.\n2.- Comprova que l’interruptor de la part posterior de l'LCD està en la posició\"IIC\". Si no ho està, apareixen caràcters estranys.","de-DE":"Es gibt zwei Möglichkeiten, warum die LCD seltsame Zeichen angibt anstelle derer, die wir programmiert haben:\n1.-Die LCD akzeptiert keine Sonderzeichen wie ä, ü, ö oder ß. Schreiben wir sie, erscheinen seltsame Zeichen.\n2.-Überprüfe, dass der Schalter auf der Rückseite der LCD auf \"IIC\" steht. Ist dies nicht der Fall, erscheinen seltsame Zeichen.","en-GB":"The LCD may show strange characters when: \n1.- We are trying to write special characters such as  “¡”, “¿” o “ñ” or accented characters. \n2.- The switch behind the LCD is in \"ISP\". Change it to \"IIC\" and reset the board for it to work correctly.","es-ES":"Hay dos posibles causas por la cual el LCD muestra caracteres extraños en vez de los que le hemos programado:\n1.- El LCD no acepta la escritura de ciertos caracteres especiales tales como “¡”, “¿” o “ñ” o caracteres acentuados. Si los escribimos, aparecerán caracteres raros.\n2.- Comprueba que el interruptor de la parte trasera del LCD está en \"IIC\". Si no lo está, aparecen caracteres extraños.","eu-ES":"Bi dira LCD-ak guk programatu ditugun karaktereen ordez karaktere arraroak erakustea eagin ditzaketen arrazoiak:\n1.- LCD-ak ez du hainbat karaktere berezi idaztea onartzen, esaterako, \"¡\", \"¿\" edo \"ñ\", edo azentua daramatenak. Idazten baditugu, karaktere arraroak ikusiko dira.\n2.- LCD-aren atzeko aldean dagoen etengailua \"IIC\" posizioan dagoela egiaztatu. Hala ez badago, karaktere arraroak agertuko dira.","fr-FR":"Il y a deux explications à cela : \n1.- L'écran LCD n'accepte pas certains caractères spéciaux, par exemple les caractères accentués. Il les remplace par des caractères étranges. \n2.- L'interrupteur situé à l'arrière de l'écran LCD doit être sur la position IIC. Sinon de drôles de caractères apparaissent !","gl":"Hai dúas posibles causas pola cal o LCD mostra carácteres estraños no canto dos que lle programamos:\n1.- O LCD non acepta a escritura de certos carácteres especiais tales como “¡”, “¿” ou “ñ” ou carácteres acentuados. Si escribímolos, aparecerán carácteres raros.\n2.- Comproba que o interruptor da parte traseira do LCD está en \"IIC\". Si non o está, aparecen carácteres estraños.","it-IT":"Se l'LCD mostra caratteri strani, diversi da quelli programmati, possono esserci due cause:\n1.- L'LCD non accetta alcuni caratteri speciali come “¡”, “¿” o “ñ” o caratteri accentati. In uno di questi casi, apparirano caratteri strani.\n2.- Verifica che l'interruttore posteriore dell'LCD sia su \"IIC\". In caso contrario, appariranno caratteri strani.","nl-NL":": \\ n1.- We proberen om speciale tekens te schrijven zoals “¡”, “¿” of \"ñ\" of tekens. \\ N2.- De schakelaar LCD  \"ISP\". deze  \"IIC\" en reset het bord.","pt-PT":"Existem duas causas possíveis pela quais podem aparecer caráteres estranhos no LCD em vez dos que foram programados:\n1.- O LCD não aceita a escrita de certos caráteres especiais tais como “¡”, “¿” ou “ñ” ou caráteres acentuados. Se forem usados, aparecem caráteres estranhos.\n2.- Verifica que o interruptor da parte traseira do LCD está em \"IIC\". Se não for o caso, aparecem caráteres estranhos.","ru-RU":"Есть две возможные причины, по которым жидкокристаллический дисплей отображает непонятные символы вместо тех, которые мы запрограммировали:\n1.- Жидкокристаллический дисплей не воспринимает написание некоторых специальных символов типа “¡”, “¿” или “ñ” или символов с диакритическими знаками. В случае их использования появятся непонятные символы.\n2.- Удостоверьтесь, что переключатель в задней части ЖКД установлен в положение «IIC». В противном случае будут появляться непонятные символы.","zh-CN":"屏幕显示奇怪的字符有两个可能的原因:\n1.-液晶不接受某些特殊字符，如“¡”, “¿” o “ñ或重音符号。如果我们写这些,会出现奇怪的字符。\n2.-检查在LCD的背面的开关是“IIC”。如果没有,会出现奇怪的字符。"},"order":20}]