[{"term":"bitbloq-faq-title-1","definition":"Bitbloq, quésaco ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-1","definition":"Bitbloq est un outil en ligne qui te permet de créer des programmes et de les charger facilement sur une carte contrôleur. Le tout sans connaissances préalables.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-2","definition":"Comment ça marche ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-2","definition":"Avec Bitbloq, tu programmes par blocs. C’est rapide et intuitif.  Tu peux créer tes propres projets et les partager avec la communauté.  L’électronique et la programmation n’ont jamais été aussi amusantes !","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-3","definition":"Qu'est-ce que je peux faire avec Bitbloq ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-3","definition":"Avec Bitbloq et l’électronique BQ, tu peux créer tout ce que tu veux : des robots, des projets de domotique pour la maison, ou encore des jeux électroniques. Laisse parler ton imagination !","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-4","definition":"Qui se cache derrière Bitbloq ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-4","definition":"Ce projet a été conçu et développé par BQ. Tu peux voir ici l'équipe grâce à qui ce projet a pris vie.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-5","definition":"À qui s'adresse Bitbloq ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-5","definition":"Aux parents qui souhaitent initier leurs enfants à la robotique, l’électronique ou encore à la programmation. Grâce à Bitbloq, ils disposeront des outils nécessaires pour découvrir ce monde passionnant. Aux enseignants qui souhaitent apprendre aux enfants à devenir des créateurs de technologie. Aux enfants qui veulent comprendre le fonctionnement de la technologie et créer librement leurs propres inventions.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-6","definition":"Quelles cartes contrôleurs puis-je utiliser ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-6","definition":"Pour le moment Bitbloq est compatible avec les cartes contrôleurs Freaduino UNO, Arduino UNO et BQ Zum, mais reste connecté, nous avons programmé l'ajout de nouvelles cartes !","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-7","definition":"Que deviennent mes projets créés dans l'ancien Bitbloq ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-7","definition":"Les projets créés dans l'ancien Bitbloq ne sont pas compatibles avec la nouvelle version. C'est pourquoi nous n'avons malheureusement pas pu les transférer. Tu devras donc recréer tes projets dans le nouveau Bitbloq. Désolés de te décevoir...","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-8","definition":"Bitbloq et Scratch","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-8","definition":"Bitbloq utilise le même paradigme de programmation que Scratch, c’est-à-dire que Bitbloq emploie des blocs s’emboîtant les uns dans les autres, comme les pièces d’un puzzle, pour construire des programmes. La programmation est ainsi accessible aux enfants car ils n’ont pas à se préoccuper de la syntaxe (c’est-à-dire qu’ils n’ont pas besoin d’apprendre à écrire le code dans un langage de programmation littéral tel que Processing, C++ ou Java). Bitbloq utilise ce paradigme car son efficacité chez les enfants a été démontrée. De plus, Scratch est déjà utilisé dans de nombreux établissements scolaires et centres éducatifs. Notre philosophie est qu’il vaut mieux unir nos forces que réinventer ce qui existe déjà. Nous avons développé Bitbloq en utilisant des bibliothèques de logiciels sous licence libre. Nous nous sommes appuyés principalement sur bloqs, une bibliothèque développée par BQ pour la création d’applications en ligne basées sur des blocs. ","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-9","definition":"Peut-on réaliser des jeux vidéo avec Bitbloq ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-9","definition":"On ne peut pas réaliser de jeux vidéo sur ordinateur, mais on peut réaliser des jeux en utilisant les composants électroniques de Mon premier kit de robotique ou d'autres composants compatibles avec la carte ZUM ou une carte compatible avec Arduino. Scratch a été conçu pour apprendre aux enfants à programmer en réalisant des jeux vidéo, alors que Bitbloq a été conçu pour apprendre aux enfants à programmer en utilisant l’électronique, et en réalisant des projets robotiques et domotiques, des inventions maison, etc.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-10","definition":"Politique de confidentialité","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-10","definition":"Les données à caractère personnel fournies intègreront un fichier géré par Mundo Reader, S.L., conformément à la règlementation espagnole de protection des données, dans le but de pouvoir fournir ce service aux utilisateurs en accord avec les conditions générales en vigueur. Notre politique de confidentialité est à consulter sur www.bq.com. En créant un compte, l'utilisateur reconnaît qu'il a lu et accepté les conditions de la politique de confidentialité. Pour toute question au sujet de notre politique ou du traitement des données personnelles, envoyer un message à lopd@bq.com.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-11","definition":"Web2Board ne s'ouvre pas dans Windows","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-11","definition":"Réinstalle Web2Board en tant qu'administrateur. Pour cela, fais un clic droit sur l'exécutable et sélectionne « Exécuter en tant qu'administrateur ».","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-12","definition":"Je n'arrive pas ouvrir ma session Bitbloq","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-12","definition":"Regarde si la date et l'heure affichées par ton ordinateur sont correctes. Si ce n'est pas le cas, corrige-les puis réessaie.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-13","definition":"Les blocs isolés ne génèrent pas de code","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-13","definition":"Avec la nouvelle structure de programmation de Bitbloq 2, tu dois connecter les blocs à un bloc de projet (Variables globales et fonctions, Instructions de départ (Setup) ou Boucle (Loop)). Si un bloc est isolé, il ne génèrera pas de code et par conséquent il n'aura pas d'effet sur la carte ou le robot.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-14","definition":"Les blocs isolés ont disparu de mon projet","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-14","definition":"Avec la nouvelle structure de programmation de Bitbloq 2, tu dois connecter les blocs à un bloc de projet (Variables globales et fonctions, Instructions de départ (Setup) ou Boucle (Loop)). Les blocs isolés disparaîtront du projet.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-15","definition":"Pourquoi les enfants de moins de 14 ans ne peuvent pas se créer un compte ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-15","definition":"Conformément à la loi organique espagnole de protection des données à caractère personnel, pour qu'un enfant de moins de 14 ans puisse se créer un compte, nous devons obtenir l'accord explicite de ses parents ou de son tuteur, et ces derniers doivent nous fournir des papiers détaillés. C'est pourquoi nous ne pouvons pas laisser des enfants de moins de 14 ans se créer de compte utilisateur. Ils devront utiliser un compte créé par un utilisateur de plus de 14 ans et ce sous la supervision de ce dernier.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-16","definition":"Ma carte contrôleur n'est pas détectée","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-16","definition":"Ce problème peut avoir différentes causes. Voici quelques possibilités. Si le problème persiste, écris-nous.\n1.- Si tu utilises une carte ZUM, vérifie que l'interrupteur est sur la position ON.\n2.- Déconnecte tous les composants connectés et réessaie de charger le programme\n3.- Débranche le câble USB de la carte puis rebranche-le.\n4.- Appuie sur le bouton reset de ta carte tout en cliquant sur Charger. Relâche le bouton juste avant que ne démarre la programmation de la carte.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-17","definition":"L'écran LCD ne s'allume pas avec ma BQ ZUM","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-17","definition":"Vérifie que le bouton ON\/OFF de ta carte est sur ON. Dans le cas contraire les composants de base fonctionnent mais ce n'est pas le cas des composants nécessitant plus de puissance.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-18","definition":"Chrome ne me laisse pas me connecter via Google plus","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-18","definition":"Mets à jour Chrome. Si tu as des mises à jour en attente, il est possible que tu n'arrives pas à te connecter.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-19","definition":"Comment dois-je connecter l'écran LCD à la carte ?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-19","definition":"Connecte le câble SCL à la broche analogique S indiquée sur Bitbloq (dans le cas d'une BQ ZUM, il s'agit de la broche bleue A5), puis le câble SDA à la broche analogique S indiquée sur Bitbloq (dans le cas d'une BQ ZUM, il s'agit de la broche bleue A4).\nTu peux connecter la broche VCC à n'importe quelle broche analogique V et tu peux connecter la broche GND à n'importe quelle broche analogique G.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-20","definition":"L'écran LCD affiche de drôles de caractères ","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-20","definition":"Il y a deux explications à cela : \n1.- L'écran LCD n'accepte pas certains caractères spéciaux, par exemple les caractères accentués. Il les remplace par des caractères étranges. \n2.- L'interrupteur situé à l'arrière de l'écran LCD doit être sur la position IIC. Sinon de drôles de caractères apparaissent !","context":"","term_plural":"","reference":"","comment":""}]