[
    {
        "term": "bitbloq-faq-title-1",
        "definition": "¿Qué é Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-1",
        "definition": "Bitbloq é unha ferramenta online que permite crear programas para un microcontrolador e cargalos no mesmo de forma sinxela e sen ter necesariamente coñecementos de programación.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-2",
        "definition": "¿Cómo funciona bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-2",
        "definition": "Con bitbloq programarás por bloques de forma rápida e intuitiva. Ademais, vas poder crear os teus propios proxectos e compartilos coa comunidade. ¡A electrónica e a programación nunca foron tan divertidas!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-3",
        "definition": "¿Qué puedo hacer en Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-3",
        "definition": "Con bitbloq e a electrónica de bq podrás crear todo o que che imaxines, desde robots até proxectos de domótica para casa, pasando por xogos electrónicos. ¡A tua imaxinación non terá límites!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-4",
        "definition": "¿Quén está detrás do proxecto?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-4",
        "definition": "Este proxecto se está deseñando e desenvolvendo desde BQ. Aquí podes ver o gran equipo que fai posible que este proxecto esté dispoñible.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-5",
        "definition": "¿A quen vai dirixido?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-5",
        "definition": "Aos pais que queren iniciar aos seus fillos na robótica, electrónica ou programación, Bitbloq daralles as ferramentas necesarias para que se penetren neste apaixonante mundo. Aos profesores que queiran ensinar aos nenos a ser creadores de tecnoloxía. Aos nenos que queiran aprender como funciona a tecnoloxía e queiran crear a súa propia sen ter ningún límite.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-6",
        "definition": "¿Qué placas soportamos?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-6",
        "definition": "Actualmente soportamos as placas Freaduino UN, Arduino UN e BQ Zum, pero próximamente engadiremos máis, ¡moitas máis!",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-7",
        "definition": "¿Onde están os proxectos que tiña no antigo Bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-7",
        "definition": "Os proxectos do antigo Bitbloq non son compatibles coa nova ferramenta, por iso non puidemos facer o traspaso. Terás que crear de novo eses proxectos na nova ferramenta. Sentimos as molestias.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-8",
        "definition": "Bitbloq e Scratch",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-8",
        "definition": "Bitbloq utiliza o mesmo paradigma de*programación que Scratch, é dicir, emprega bloques que encaixan uns con outros coma se fose un puzzle para construír programas. Isto permite que a programación sexa accesible para os nenos, porque non teñen que preocuparse pola sintaxe (non necesitan aprender como se escribe código nunha linguaxe de programación literal como Processing, C ou Java). bitbloq utiliza este paradigma porque está demostrada a súa eficacia entre os nenos e porque, ademais, scratch xa se utiliza en multitude de escolas e centros educativos. A nosa filosofía é que é mellor axuntar forzas que reinventar a roda. desenvolvemos bitbloq utilizando bibliotecas de software con licenza libre, fundamentalmente bloqs, unha biblioteca desenvolvida por BQ para a creación de aplicacións online baseadas en bloques.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-9",
        "definition": "¿Poden facerse videoxogos con bitbloq?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-9",
        "definition": "Non poden facerse videoxogos no computador, pero os xogos utilizando a electrónica do meu Primeiro Kit de Robótica ou calquera outra electrónica que use a placa ZUM ou unha placa compatible con Arduino. Scratch foi diseado para ensinar aos nenos a programar realizando videoxogos, mentres que bitbloq foi diseado para ensinar aos nenos a programar usando electrónica e realizando proxectos robóticos, domótica, inventos caseiros, etc.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-10",
        "definition": "Política de privacidade",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-10",
        "definition": "Os datos de carácter persoal proporcionados formarán parte dun ficheiro cuxo responsable é Mundo Reader, S.L., o cal se xestiona conforme á normativa española de protección de datos coa finalidade de poder prestar este servizo aos usuarios conforme ás condicións xerais vixentes. Consulte nosa a política de privacidade en www.bq.com. Creándose unha conta o usuario recoñece que leu e acepta as condicións da política de privacidade. Si ten calquera dúbida respecto de a política ou o tratamento que facemos dos seus datos persoais, contacte con lopd@bq.com.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-11",
        "definition": "eb2Board non se abre en Windows",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-11",
        "definition": "Reinstala Web2Board como administrador. Para iso fai click dereito sobre o ejecutable e selecciona \"Executar como administrador\".",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-12",
        "definition": "Non podo iniciar sesión en Bitbloq",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-12",
        "definition": "Comproba si a data e hora do teu computador son correctas. Si non é así, corríxelas e proba de novo.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-13",
        "definition": "Os bloques que están soltos non xeran código",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-13",
        "definition": "A nova estrutura de programación de Bitbloq 2 está pensada de tal forma que debes conectar os bloques a algún bloque de proxecto (\"Variables globais e funcións\", \"Instrucións iniciais (Setup)\" ou \"Bucle principal (Loop)\"). Calquera bloque non conectado non xerará código e xa que logo non se verá o seu efecto na placa ou robot.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-14",
        "definition": "Os bloques que están soltos desapareceron do meu proxecto",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-14",
        "definition": "A nova estrutura de programación de Bitbloq 2 está pensada de tal forma que debes conectar os bloques a algún bloque de proxecto (\"Variables globais e funcións\", \"Instrucións iniciais (Setup)\" ou \"Bucle principal (Loop)\"). Calquera bloque non conectado non se gardará no proxecto.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-15",
        "definition": "¿Por qué non poden crearse unha conta os menores de 14 anos?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-15",
        "definition": "Debido á Lei Orgánica de Protección de Datos de Carácter Persoal, para que un menor de 14 anos poida crearse unha conta, deberiamos de ter permiso explícito do pai\/nai\/titor, e estes proporcionarnos extensa documentación. Por esa razón non podemos permitir que se creen contas de usuario, senón que terán que utilizar contas de usuario creadas por usuarios maiores de 14 anos e usar Bitbloq acompañados de devandita persoa.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-16",
        "definition": "Non me detecta a placa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-16",
        "definition": "Pode haber distintos problemas polos cales non detectar a placa. Aquí che listamos algúns. Próbaos e si segues sen que se che detecte, envíanos unha mensaxe.\n1.- Si a placa é unha zum, comproba que o interruptor está en \"ON\"\n2.- Desconecta todos os compoñentes conectados e proba a subir o programa de novo\n3.- Desconecta o usb da placa e volve conectala\n4.- Aperta o botón de reset da placa mentres lle dás a \"cargar\". Sóltao xusto antes de que comece a programar a placa",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-17",
        "definition": "Non se acende o LCD cando se conecta á bq ZUM",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-17",
        "definition": "Asegúrache de que o botón on\/off da placa está en posición on, pola contra, os compoñentes sinxelos si funcionarán, pero aqueles compoñentes que necesiten maior potencia, non funcionarán.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-18",
        "definition": "Non me deixa acceder por Google plus con Chrome",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-18",
        "definition": "Actualiza Chrome á última versión, xa que si ten actualizacións pendentes, é posible que non che deixe acceder.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-19",
        "definition": "¿Cómo conectase o LCD a la placa?",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-19",
        "definition": "Tes que conectar o cable de SCL ao pin \"S\" analóxico indicado en Bitbloq (nunha bq ZUM, sería conectalo ao pin azul A5), despois o cable SDA, no pin \"S\" analóxico indicado en Bitbloq (nunha bq ZUM, sería no pin azul A4).\nO pin VCC conéctase a calquera pin analóxico \"V\" e o pin GND conéctase a calquera pin analóxico \"*G\".",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-title-20",
        "definition": "A placa LCD móstrame caracteres raros",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    },
    {
        "term": "bitbloq-faq-content-20",
        "definition": "Hai dúas posibles causas pola cal o LCD mostra carácteres estraños no canto dos que lle programamos:\n1.- O LCD non acepta a escritura de certos carácteres especiais tales como “¡”, “¿” ou “ñ” ou carácteres acentuados. Si escribímolos, aparecerán carácteres raros.\n2.- Comproba que o interruptor da parte traseira do LCD está en \"IIC\". Si non o está, aparecen carácteres estraños.",
        "context": "",
        "term_plural": "",
        "reference": "",
        "comment": ""
    }
]