[{"term":"bitbloq-faq-title-1","definition":"¿Qué es Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-1","definition":"Bitbloq es una herramienta online que permite crear programas para un microcontrolador y cargarlos en el mismo de forma sencilla y sin tener necesariamente conocimientos de programación.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-2","definition":"¿Cómo funciona Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-2","definition":"Con Bitbloq programarás por bloques de forma rápida e intuitiva. Además, podrás crear tus propios proyectos y compartirlos con la comunidad. ¡La electrónica y la programación nunca han sido tan divertidas!","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-3","definition":"¿Qué puedo hacer en Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-3","definition":"Con Bitbloq y la electrónica de BQ podrás crear todo lo que te imagines, desde robots hasta proyectos de domótica para casa, pasando por juegos electrónicos. ¡Tu imaginación no tendrá límites!","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-4","definition":"¿Quién está detrás del proyecto?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-4","definition":"Este proyecto se está diseñando y desarrollando desde BQ. Aquí puedes ver el gran equipo que hace posible que este proyecto esté disponible.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-5","definition":"¿A quién va dirigido?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-5","definition":"A los padres que quieren iniciar a sus hijos en la robótica, electrónica o programación, Bitbloq les dará las herramientas necesarias para que se adentren en este apasionante mundo. A los profesores que quieran enseñar a los niños a ser creadores de tecnología. A los niños que quieran aprender cómo funciona la tecnología y quieran crear la suya propia sin tener ningún límite.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-6","definition":"¿Qué placas soportamos?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-6","definition":"Actualmente soportamos las placas Freaduino UNO, Arduino UNO y BQ Zum, pero próximamente añadiremos más, ¡muchas más!","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-7","definition":"¿Dónde están los proyectos que tenía en el antiguo Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-7","definition":"Los proyectos del antiguo Bitbloq no son compatibles con la nueva herramienta, por eso no hemos podido hacer el traspaso. Tendrás que crear de nuevo esos proyectos en la nueva herramienta. Sentimos las molestias.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-8","definition":"Bitbloq y Scratch","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-8","definition":"Bitbloq utiliza el mismo paradigma de programación que Scratch, es decir, emplea bloques que encajan unos con otros como si fuera un puzzle para construir programas. Esto permite que la programación sea accesible para los niños, porque no tienen que preocuparse por la sintaxis (no necesitan aprender cómo se escribe código en un lenguaje de programación literal como Processing, C++ o Java). bitbloq utiliza este paradigma porque está demostrada su eficacia entre los niños y porque, además, scratch ya se utiliza en multitud de escuelas y centros educativos. Nuestra filosofía es que es mejor aunar fuerzas que reinventar la rueda. Hemos desarrollado bitbloq utilizando bibliotecas de software con licencia libre, fundamentalmente bloqs, una biblioteca desarrollada por BQ para la creación de aplicaciones online basadas en bloques.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-9","definition":"¿Pueden hacerse videojuegos con Bitbloq?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-9","definition":"No pueden hacerse videojuegos en el ordenador, pero sí juegos utilizando la electrónica de Mi Primer Kit de Robótica o cualquier otra electrónica que use la placa ZUM o una placa compatible con Arduino. Scratch ha sido diseñado para enseñar a los niños a programar realizando videojuegos, mientras que Bitbloq ha sido diseñado para enseñar a los niños a programar usando electrónica y realizando proyectos robóticos, domótica, inventos caseros, etc.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-10","definition":"Política de privacidad","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-10","definition":"Los datos de carácter personal proporcionados formarán parte de un fichero cuyo responsable es Mundo Reader, S.L., el cual se gestiona conforme a la normativa española de protección de datos con la finalidad de poder prestar este servicio a los usuarios conforme a las condiciones generales vigentes. Consulte nuestra la política de privacidad en www.bq.com. Creándose una cuenta el usuario reconoce que ha leído y acepta las condiciones de la política de privacidad. Si tiene cualquier duda respecto a la política o el tratamiento que hacemos de sus datos personales, contacte con lopd@bq.com.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-11","definition":"Web2Board no se abre en Windows","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-11","definition":"Reinstala Web2Board como administrador. Para ello haz click derecho sobre el ejecutable y selecciona \"Ejecutar como administrador\".","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-12","definition":"No puedo iniciar sesión en Bitbloq","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-12","definition":"Comprueba si la fecha y hora de tu ordenador son correctas. Si no es así, corrígelas y prueba de nuevo.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-13","definition":"Los bloques que están sueltos no generan código","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-13","definition":"La nueva estructura de programación de Bitbloq 2 está pensada de tal forma que debes conectar los bloques a algún bloque de proyecto (\"Variables globales y funciones\", \"Instrucciones iniciales (Setup)\" o \"Bucle principal (Loop)\"). Cualquier bloque no conectado no generará código y por tanto no se verá su efecto en la placa o robot.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-14","definition":"Los bloques que están sueltos han desaparecido de mi proyecto","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-14","definition":"La nueva estructura de programación de Bitbloq 2 está pensada de tal forma que debes conectar los bloques a algún bloque de proyecto (\"Variables globales y funciones\", \"Instrucciones iniciales (Setup)\" o \"Bucle principal (Loop)\"). Cualquier bloque no conectado no se guardará en el proyecto.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-15","definition":"¿Por qué no pueden crearse una cuenta los menores de 14 años?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-15","definition":"Debido a la Ley Orgánica de Protección de Datos de Carácter Personal, para que un menor de 14 años pueda crearse una cuenta, deberíamos de tener permiso explícito del padre\/madre\/tutor, y estos proporcionarnos extensa documentación. Por esa razón no podemos permitir que se creen cuentas de usuario, sino que tendrán que utilizar cuentas de usuario creadas por usuarios mayores de 14 años y usar Bitbloq acompañados de dicha persona.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-16","definition":"No me detecta la placa","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-16","definition":"Puede haber distintos problemas por los cuales no se detecta la placa. Aquí te listamos algunos. Pruébalos y si sigues sin que se te detecte, envíanos un mensaje.\n1.- Si la placa es una zum, comprueba que el interruptor está en \"ON\"\n2.- Desconecta todos los componentes conectados y prueba a subir el programa de nuevo\n3.- Desconecta el usb de la placa y vuelve a conectarla\n4.- Aprieta el botón de reset de la placa mientras le das a \"cargar\". Suéltalo justo antes de que comience a programar la placa","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-17","definition":"No se enciende el LCD cuando se conecta a la bq ZUM","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-17","definition":"Asegúrate de que el botón on\/off de la placa está en posición on, de lo contrario, los componentes sencillos sí funcionarán, pero aquellos componentes que necesiten mayor potencia, no funcionarán.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-18","definition":"No me deja acceder por Google plus con Chrome","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-18","definition":"Actualiza Chrome a la última versión, ya que si tiene actualizaciones pendientes, es posible que no te deje acceder.","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-19","definition":"¿Cómo se conecta el LCD a la placa?","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-19","definition":"Tienes que conectar el cable de SCL al pin \"S\" analógico indicado en Bitbloq (en una bq ZUM, sería conectarlo al pin azul A5), después el cable SDA, en el pin \"S\" analógico indicado en Bitbloq (en una bq ZUM, sería en el pin azul A4).\nEl pin VCC se conecta a cualquier pin analógico \"V\" y el pin GND se conecta a cualquier pin analógico \"G\".","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-title-20","definition":"La placa LCD me muestra caracteres raros","context":"","term_plural":"","reference":"","comment":""},{"term":"bitbloq-faq-content-20","definition":"Hay dos posibles causas por la cual el LCD muestra caracteres extraños en vez de los que le hemos programado:\n1.- El LCD no acepta la escritura de ciertos caracteres especiales tales como “¡”, “¿” o “ñ” o caracteres acentuados. Si los escribimos, aparecerán caracteres raros.\n2.- Comprueba que el interruptor de la parte trasera del LCD está en \"IIC\". Si no lo está, aparecen caracteres extraños.","context":"","term_plural":"","reference":"","comment":""}]